[
  {
    "title": "Utter bullshit masquerading as art, allegory or whatever excuse some deluded critics are calling it, 'Mother!' is a loathsome exercise in self-indulgence",
    "content": "I'll be honest  I f**king hated 'Mother!', and by that I mean I absolutely loathed it. If you thought 'Black Swan' was pretentious, well you haven't yet seen writer-director Darren Aronofsky's latest self-aggrandizing piece of 'artistic filmmaking'.The titular character is never named, and as played by Jennifer Lawrence, is the adoring wife of an also unnamed middle-aged poet  referred to as 'Him' (Javier Bardem)  stuck in writer's block. They live in a gorgeous octagonal Victorian mansion, which she is painstakingly renovating. We find out later that the house was burned down in a fire which consumed her husband's first wife, and that he had pulled from the ashes a burnished crystal which he now displays proudly in his study.Then out of the blue, a stranger (Ed Harris) turns up at their doorstep. He says he's an orthopaedic surgeon who's looking for a place to stay, and that he had mistaken their house for a bed-and- breakfast. To her horror, 'Him' invites the 'man' to stay; and by the next day, his wife (Michelle Pfeiffer) arrives, followed by their two quarrelling sons (Domhnall and Brian Gleeson). Before the day is over, one son will bludgeon and accidentally kill the other, resulting in a pool of blood on the wooden floorboards that she will scrub clean save for a patch shaped in a vagina.It doesn't take a genius to see the parallel with the Cain and Abel story in the Bible, or the 10 plagues that make a brief appearance one by one. Those familiar with Aronofosky will know that he has been fascinated with Christianity  from his first feature 'Pi' to 'Noah' to 'The Fountain', Aronofsky has consistently drawn allegories and imagery from Biblical stories. 'Mother!' is no different, but there is no coherence, no logic and no purpose in his references here.The anything-goes, anyhow-told narrative has unwelcome strangers turning up at her house to mourn the death of the 'man's' son, an unleashing of pent-up passion between her and 'Him', her unexpected pregnancy afterwards that lets her morph into the Virgin Mary, her husband's sudden inspiration and overnight success, the arrival of cult followers that want to use her newborn son as blood sacrifice, and last but not least plenty of sectarian wars and conflict that culminate in a full cycle of destruction and reincarnation. Only those enamoured with 'bullshit' will think that revealing any of these unexpected twists and turns amounts to 'spoilers'; but really, it's a lot of shock-and-awe wrapped around a bastardisation of notable Biblical tales for absolutely nothing.Indeed, even more absurd than the movie itself is how some have tried so strenuously to justify its nonsense. One reading has it as an allegory for the abuse of Mother Earth, a warning for climate change; another explains how it describes the process by which art is created and how the artist eventually becomes a slave to that art; another talks about how some men have treated their women in marriage, reducing them to supporting roles and robbing them of agency and respect. Neither of these interpretations disguises the fact that the movie is a haphazard mess of ideas that never amounts to anything substantial or compelling.Why then should we put up with its misogyny? Why then should we put up with the overwrought delirium that just gets more and more sickening? Or more fundamentally, why should we even care about what's happening on screen? Not even Lawrence, or Bardem, or Harris, or Pfeiffer can add depth to their characters, which are so thinly written that we wonder why the actors even bothered. And therein lies the stark truth about the madness we are supposed to discern as an expression of profound ideas  there is simply nothing behind it, no meaning, no wit and certainly no redemption.'Mother!' is the sad product of an artist's self-indulgence taken to its own grotesque extremes. It is no art, it is no genius, and it is definitely no masterpiece, despite critics caught up in the same pretension will try to convince you. If you're curious about why we hated it so much, then go see it by all means; otherwise, stay away from this motherf**king disaster.",
    "rating": "2"
  },
  {
    "title": "Heavy Ingredients Severely Undercooked",
    "content": "I was in the right mood for a smart horror film, they used to be my favorite kind of film until they sort of disappeared, the smart part not the horror. I'm a huge fan of Polanski's The Tenant - it terrified me more than any other film, followed shortly by 2 other Roman Polanski masterpieces, Repulsion and Rosemary's Baby. There are others - Nicolas Roeg's Don't Look Now, Martin Donovan's Apartment Zero, Alex De La Iglesias's La Comunidad, Davin Lynch's Eraserhead and Blue Velvet in particular. Most of Luis Bunuel's work and a few others. Mother! reminded me somehow of some of them but it was just like a tease that didn't really matured into anything.Here everything is outrageously on the nose but not in a phenomenal Ken Russell way but in a rather obvious, unconvincing, \"look at me\" kind of thing. I love Jennifer Lawrence but in Mother! she wakes up at the beginning of the film and she's already panicky. Please, don't misunderstand me, I'm not suggesting a prequel! No, clearly Darren Aronfski gave the audience too much credit or not enough because for me, as a member of the audience, left me cold. I may have winced at the sight of blood but it didn't frighten me. The \"wound\" on the floor? Remember the hole in the wall of \"The Tenant\"? Maybe it's my fault. I've seen too many films and young audiences haven't. I've read some of the positive comments and I imagine they are from very young people who feel, quite rightly, they been given something besides Marvel and they have. I only hope they use it as a gateway to discover some of the \"old\" films. And as for Mother! what I enjoyed was the totally unexpected turn by Michelle Pfeiffer. Dark and funny, mocking or better still, paying tribute to Ruth Gordon - I imagine. I left the theater with a desperate need to revisit Rosemary's Baby and you know what? I will. So after all said and done, thank you.",
    "rating": "5"
  },
  {
    "title": "It made me miss Rosemary Woodhouse",
    "content": "Darren Aronfsky is a director I follow, even since Pi. He's daring and unpredictable. I loved Requiem For A Dream and Black Swan, the rest of his opus has left me puzzled or downright annoyed. Mother! belongs to the later. All the element's were there - Rosemary's Baby written by Edward Albee - that's what I thought right up to Michelle Pfeiffer's entrance, then something happened - The movie falls through a totally unbelievable, hysterical downward spiral. What? Yes, exactly. Jennifer Lawrence suffers, puffs and moans from the very first frame, well second frame. She's afraid from the word go. She could run away but for some reason she never ventures out of the house. Questions like that become a massive obstacle for us to care and feel connected - Think of Mia Farrow in Rosemary's Baby or Colin Firth in Apartment Zero - co-habitating with a devil, surrounded by sinister neighbors or unwanted visitors. Those films also had sensational scripts and the narrative even when symbolic was always solidly based on the story at hand - Here it feels like gimmicks - One idea and then round and round the mulberry bush. I don't know how many times she shouts at her husband \"Please make them leave\" - Jennifer Lawrence goes through it valiantly and vociferously. Javier Bardem as the egomaniacal husband is absurdly unconvincing - and I'm a devoted a fan - Michelle Pfeiffer is the one who brings something new to the proceedings and a truly startling performance. Other than that, I'm sorry to say no to Mother!",
    "rating": "4"
  },
  {
    "title": "Thick on analogies and symbolism, to the point of overkill",
    "content": "I saw this at TIFF and the point this movie was trying to make became clear fairly early on. That's not necessarily a bad thing, but as the story developed, the analogies and symbolism went into overkill, to the point where their excessive nature diminished what was an interesting story.The movie is helmed by Jennifer Lawrence and Javier Bardem, two actors I'm particularly fond of. The short summary of this movie is that they are a couple who live in a beautiful, remote home. One night they take in an unwanted house guest (Harris), more at Bardem's choosing than Lawrence's. This leads to countless other house guests and invasions from the outside world, often to the detriment of Bardem & Lawrence's beautiful home, and Lawrence's well-being. As the movie goes on, these violations against the home and Lawrence get increasingly bizarre and excessive. They get laid on so thick that, even if you have figured out the analogy by the midway point of the movie and enjoy the way the movie is getting it's point across, the sheer madness that transpires in the second half of the film is likely to sour you on the overkill applied to the message. It becomes fairly apparent that the house and Lawrence's character from which the movie is titled represent our planet. Bardem's character represents a creator/God (in credits, his character is simply known as 'Him'). Harris and Pfeiffer, the original, invasive guests, are the original Man & Woman (Adam & Eve), and from there, a lot of the plot initially descends from biblical references and then into His desire to provide for his followers and to be adored by them, ignorant of how detrimental they are to the house and Mother. At the very end, the house becomes overpopulated with people who are both zealots and warmongers who descend into utter 'WTF' madness while they destroy the home, murder the couple's child, and force Mother to burn down the home she so painstakingly created, killing everyone inside it. After the fire, He carries her out, and recreates the home with a new Mother. As I said, it's a story thick on symbolism and message. I personally liked what they were going for, but think it could have been a much better movie if they had done it far subtly than with the extreme overkill they employed in the second half of this film. Looking at the reviews, I see a lot of people torn by this movie, and I think for these reasons. Some people didn't clue into the message very well and just thought it was a movie that made no sense. Others may not have liked the pro-environment analogies, while some may have loved how excessive the movie hammered it's point home. Another group likely felt how I did - that the plot and point was unique and interesting, but the sheer madness the film careened into during the second half was extremely excessive.Overall, I give it a 6/10, with disappointment that a promising concept wasn't executed more sensibly.",
    "rating": "6"
  },
  {
    "title": "Insane, beautiful, terrorizing, epic, puzzling, intoxicating, gross, masterful. (Spoilers)",
    "content": "First, I must laugh at all the reviews of people who had no idea what they were watching. We must all realize that all films are not written for all people who watch. Just as I usually do not go see cartoon films, others should give good thought before seeing such an 'artsy' film as Mother!. Hey, if you didn't like Black Swan, think more than twice on this one.Observation: There is a fire. Woman's face burning up. When cut to Javier holding a crystal. He places the crystal on a metal stand and we watch the house start healing itself, starting at that crystal. We cut to other parts of the house, as it heals, from fire back to normal. Eventually we cut to a bedroom where we see the bed healing itself and someone under the covers. She arises and it is Mother, played by Jennifer. Odd names for a film, right, but the names are never said in the film. We learn that Him is an accomplished poet, but it seems like he is going through some type of writer's block. Mother's mission is to refinish the house. A lot has been done, but there is always more work to do. A man played by Ed Harris knocks at the door and Him greets the man and allows him to enter, almost happy someone else is in the house. The man is a doctor, but he smokes and drinks which causes him getting sick, fairly easily. It doesn't bother Him, but Mother is quite concerned.Soon someone else arrives, a woman played by Michelle Pfeiffer. Turns out the woman is the man's wife. She's a feisty one played convincingly by Pfeiffer. Mother seems confused why Him allows these strangers to stay in their house. The woman doesn't hold anything back when she has a conversation with Mother. The woman asks why they don't have a baby? Mother is pretty taken back by how forward the woman is. This does not bother the drunk woman.The man & woman seem to find a fascination with the crystal. Mother tells them not to touch it, but eventually they sneak in the room and break it into 100's of pieces. Him becomes enraged! Mother wants the man and woman to leave, but they don't and it's seems Mother is powerless. Mother goes to their room and they are having sex so she leaves. Even though Him is very upset he does not ask them to leave. Are you putting the pieces together? 2 more guests, 2 sons arrive. They fight, one becomes badly hurt & Him, the man & woman take him to the hospital, but Him comes back and tells Mother he died. Soon people start showing up, apparently for the funeral for the son and as more arrive things become chaotic. Every person seems to represent something different. The house becomes a disaster as everyone starts stealing everything! After everyone leaves Him & Mother have a fight which turns into sex. After Mother says she is pregnant. Him then becomes inspired to write a new poem. He gives it to Mother to read. She cries and tells Him it is magnificent. People start showing up again to praise Him for his poem. It is at this point things start to become totally chaotic. Let's just say lots of people show up and Aronofsky puts things in overdrive! The insanity on the screen is brilliant and here is why I believe this Interpretation: The film is basically an allegory our entire existence, and then some. Him is G*d. Mother is Mother Nature or as Him calls her, home. Him creates man and woman as Mother Nature creates everything around them. The Poem is the Bible. The house is the world. The man is Adam, the woman Eve. The sons Cain & Abel. We then basically witness an insane, quick review from Christ to present time (about 20 minutes), and then the demise of mankind. The film's use of the crystal represents the 'Apple'.Conclusion: When we look at this film in its entirety, taking 2 steps back, we see the film summarizes man's existence. The beginning of the film shows he tried before, but failed. Our existence, most of the film, also fails. At the end, we see Him try once again. G*d's dilemma is free will. Him only leads by verse (the Bible), but man's interpretation is what creates conflict, as everyone has their own interpretation, thus anarchy eventually occurs & eventually obliteration. Eden gets a restart, over & over again.I find the film to be amazing in scope, like Cloud Atlas or A's The Fountain. Like I said earlier, if you don't appreciate films like these, or even Black Swan don't bother. It's simply not your brand. I feel the film is an amazing encapsulation of our existence performed in very unique fashion. The message here is strong. I prefer the avant-garde probably because I've seen so many films. I need to view films that present something new, and this one certainly does. For me, it is a masterpiece. Aren't artists allowed to target their audience? They all can't have happy endings. My 1000 words worth.",
    "rating": "10"
  },
  {
    "title": "a film that fails on multiple levels",
    "content": "The principle rule of allegory is that it must function on two levels - the plain narrative, what the audience sees or reads, and the metaphorical, the level beyond the seen or read, usually conveying a deeper meaning. An allegory which fails as a narrative is a morality play; an allegory that fails on the metaphorical level is a nonsensical tale. mother! fails on both levels, and the result is a confusing mess as likely to bore as it is to disgust. The script is stark, but as opposed to offering up a Hemingway-esque brevity and punch, it instead descends to the level of drive by dialogue, actors delivering short statements with blank expressions and then leaving the room they're in. Granted, the actors only had Aronofsky's script to work with, and he's on record as saying it only took five days to write, which is visible in every scene. An undergrad brags about finishing their paper the night before it's due; a screenwriter should not laud a similar process for his film. The only film that comes close to the delivery in mother! is The Room, which may very well be the superior of the two. And if you told me that Bardem, normally a captivating actor, had modeled his performance of Him on Wiseau's Johnny, I would readily believe you.In fact, the only actor who brings any life to this joyless epic is Pfeiffer, whose facial expressions and tone elevate her sniping dialogue far above the written quality. She's also the only one who brings any passion to her role, as Lawrence seems to have been reduced to two speeds - blank expression and monotone speech, or screaming so hard she cracks a rib. All granularity seen in her previous performances is gone here. The characters portrayed by normally fine actors are so small, so one dimensional, one barely cares about them as people, let alone as stand ins for something larger than themselves. I could muster neither sympathy nor even vague interest in the foibles and woes of this couple, nor their never-ending torrent of house guests. (Judging by the laughs in the theater, I wasn't the only one.) Their tragedies in the final third were grating, not because they were disgusting, or shocking, but because I was never interested in them to begin with. The setting is a perfect mirror to Lawrence's acting, if not her character. The film takes places in a rustic, half finished house. As before with the script, any attempt at a spare beauty is never realized, and the end result looks like the set designers didn't want to spend too much time on something they knew would literally be ripped apart in the final act. The house is our only setting in this film, so its lack of visual interest is a massive detriment. The cinematography is likewise lackluster, with nothing special to either set it apart or condemn it. It is filmed adequately. The story and performances were clearly meant to be the jewel here, a situation analogous to purchasing a workable frame only to enshrine pages from the 1988 Albuquerque phone book therein. And since I brought up analogy, the elephant in the room, the roughshod Biblical allegory. Said allegory falls flat on its face as soon as its analyzed in the slightest. Lawrence is Aronofsky's self insertion character (in the style of bad fan fiction) to the Christian canon, a Gaia character who forms an unbalanced duality with Him, the writer's presentation of the Christian God. Him is never very godlike, and his standing as \"God\" is simply revealed to us at the end, a classic example of telling and not showing. While observant viewers may be able to deduce his role from context earlier in the film, he is never characterized in a way that makes his stated role fit his perceived role. An allegory is not proclaiming a character to be other than they have been observed by way of a brief statement at the end. The titular mother, the self insertion Gaia character, has a similar problem - she demonstrates none of the qualities common to portrayals of Mother Earth figures in fiction. Instead, she is aloof, credulous, and dense. If the point intended to be made was Aronofsky's self-proclaimed howl about the treatment of the planet, perhaps he should have created a Mother Earth figure that was remotely sympathetic, or relatable. What we have instead is a distant robot whose demise was met with yawns. The revelation, easily predicted from the first scene, that this is a cycle these characters have been locked in since time immemorial, fails to shock or elicit a reaction, unless one counts exasperation. It also drives the allegory firmly off the rails, moving our underlying mythology from a Christian creation and eschatology to something more Eastern, with reality a cyclical illusion. There was an opportunity here for a valid story to be told on multiple levels. We live in an era of man made climate change and contemporary Christianity is ripe for criticism. A more skilled writer and director could have pulled off a tale that would be as heartbreaking as it was true. And perhaps Aronofsky could have done that, had he taken his time and revised even the slightest bit. (However, as this is his second failure in a row that deals with Biblical themes, perhaps not.)What we are treated to instead is the cinematic equivalent of soda crackers and a brief lecture by an inarticulate first year undergrad about religion and environmentalism. I wish I could end this with the famous quotation from King Lear, but it's not entirely accurate. We were only given the idea of sound and fury, not the genuine article. This film is the shadow of a shadow, and in that, at least, it does signify nothing.",
    "rating": "1"
  },
  {
    "title": "Fell Incredibly Short of Expectations",
    "content": "I really like D. Aronofsky's films. As a whole, he has a solid corpus.This film, however, had significant structural problems which shake its foundation as a film.The film is split into two parts...Why? It's not clear. It's also not clear what the two plot-lines mean. There is not \"real\" connection to piece them together and the viewer is pushed to create their own...This viewer sees a meaningless old testament - new testament relationship. But interplay? Not much. There seems to be a Cane and Able story in the first half. You know what happens... But how this is relevant to the main actors (the husband and wife) who take this couple and, subsequently, their two sons in. The husband and wife host the big family argument. Why? Dunno?The second half, when J. Lawrence, has her child, we are thrust into a tired boy-Jesus plot line and his subsequent sacrifice a la New Testament plot themes. But why? And what do these two halves of the movie have to do with one another...apart from the first being an old testament story and the second being one from the new testament.The ending is violent and contrived, yet is a very good dream sequence, albeit Lawrence is not dreaming (or is he?).Two old Polanski homages, albeit super-heavy-handed, incessantly bombard you throughout the movie...The Apartment and Rosemary's Baby. But is it an homage or just meaningless lifting of motifs? The hole in the wall and the bloody hole (aka vagina) are direct parallels. As is the baby sacrifice or offering in both.All in all it was watchable. Had some interesting points. Good camera work. Good effects. But the story doesn't hold up on any level, except in the mind of some viewers who need to stitch it together and make sense of it themselves in their own way...Perhaps that was the abstract goal.",
    "rating": "3"
  },
  {
    "title": "Art's Not Safe",
    "content": "Went to the first matinée available locally and I am still thinking the picture over. Will definitely see this one again, if it hasn't left the theatre abruptly. I was certainly horrified by the film, which is a good thing, as I had assumed it was a horror picture. It is, of course, much more than that. Nonetheless, it is NOT The Conjuring or Get Out (both good films, for sure), so just be warned.By now you are aware that the film has been controversial, also a good thing. Jennifer Lawrence does a fine job and her career is certainly not going to suffer for her performance. I am not exactly a JLaw \"fan\" (could live without the Hunger Games), although I will pay closer attention to her future performances, especially if she pulls off more roles like this one (really liked Winter's Bone, by the way). As I understand the Hollywood scene, it is a respectable personal decision to take on a challenging role in an avant garde picture, especially if you have already banked serious money from popular roles in blockbusters. Javier Bardem, Michelle Pfeiffer, and Ed Harris also do their respective parts justice--a well-acted film by A-listers, overall. Camera work and special effects are also impressive.The story is genuinely disturbing in a Requiem for a Dream way, so don't go if you can't handle that sort of thing. Some of the violence is, indeed, OVER THE TOP. Seriously, not for the faint of heart. Aside from the biblical allegory stuff, I found the character portrayals creepy as hell in a (sur?)realistic David Lynch-esque way. Hell is other people!I applaud Mr. Aronofsky for keeping his vision intact all the way to the big screen. For reference, I just don't need any more movies based on superheros, comic books (except The Tenth or Gen 13), children's cartoons, vampires fighting werewolves, or horror stick about unfriending weirdos on facebook. You will have to make up your own mind on this one, so please do just that. Even if you end up despising the film, try to remember that, to quote Rob Zombie, \"Art's Not Safe.\"",
    "rating": "8"
  },
  {
    "title": "complete waste of 2hrs",
    "content": "Went to see this film hoping that it would be a decent one but very disappointed, wanted to leave after 1 hr but stayed in case things got better how wrong was that!! The film has a good cast but the plot is numbingly boring it is like a remake of 'Rosemary's Baby' but with more people than you would find at rush hour on the district line at the end of it. I cannot recommend this film to anyone.",
    "rating": "1"
  },
  {
    "title": "My god, mother is one hell of a film.",
    "content": "First of all, please don't watch this film if you have trouble understanding metaphors & symbolism.It's pretty clear that there are quite a number of reviews/rants on this page with people expressing their hate towards the story and how it's been portrayed on screen. It's strange because it looks like they had absolutely no idea what they were watching... it's trivial and shallow to publish a review without any research. However, I do agree that it isn't an easy one to sit through, but some of the greatest films aren't. So again, please don't bother checking it out if your mind is closed, you won't appreciate this masterpiece.To help deter unaccommodating opinions being regurgitated, I'll try to explain what made the film worth your time.I believe there are two themes that can be interpreted from Mother!! Therefore, the use of an additional explanation mark is required.***SPOILERS BELOW***Religious Theory;Pretty sure the inconvenient truth to this theory is that when the sh*t hits the fan, mother doesn't like people messing up her house (Earth). Apparently, Darren Aronofsky is not religious but he likes strong environmental messages. He also wrote the script in 5 days.. how long did it take God to create the world? Just saying.Jennifer Lawrence is (Mother) Earth  The house is Earth.Javier Bardem (Him) is God  Creator of life on Earth, loves attention, and forgives everyone.Ed Harris (Man) is Adam  Invited by God to Earth (aka house)Michelle Pfeiffer (Woman) is Eve  Created from Adam's rib (scene where Ed Harris was sick on the toilet)The crystal is the forbidden fruit (apple)The baby is the bread at the last supper \"Body of Christ\"Relationship Theory;An extreme version of anxiety in a relationship that is deteriorating. The tense build-up in social interactions and how someone may view a scenario where they feel left out and forgotten. The jealousy someone feels when their bond is shared. Not paying attention to the needs of one another in a relationship. Having a baby to keep the relationship alive. All these emotions are magnified/multiplied by 100 to the point it's literally terrifying, so crazy that it may make you laugh. Finally, once the love has completely diminished, the only thing left is to leave and start again new.Either way, this film is unique and original in the way it's portrayed, packaged and presented. Hope you can appreciate the beauty of this Gothic religious tale / art-house opera and award the actors & production team that helped make it possible.",
    "rating": "10"
  },
  {
    "title": "I want my 2 hours back!",
    "content": "In a nutshell..... The story of a writer-blocked poet (Bardem) and his beautiful young wife (Lawrence) who has adoring fans (including Ed Harris and his wife Michelle Pfeiffer) that flock to his home just to be in his presence. Forgive the run on sentence........Harris is dying of cancer, his two sons arrive to fight over his money, get into a fistfight and one gets killed, more fans arrive, Lawrence goes into labour, fans start to riot, tearing the house apart, she has the baby, he wants to show his fans, she says no, he sits and stares at her for days, she falls asleep, he takes the baby, shows his fans, they grab the baby, kill it and eat it, Mom goes nuts, runs to the basement with a wrench, bashed a hole in the oil tank and sets it on fire and blows up the whole place, Bardem carries her charred body, sets her down and proceeds to reach in her chest and take out her heart, with her permission. He squeezes her heart til it turns to glass, sets it in a stand, the next scene there's a new wife and the whole thing starts over again. There! Just saved you $10........you're welcome!",
    "rating": "1"
  },
  {
    "title": "I created an account literally to rate/review this movie",
    "content": "30+ years of watching movies and never created an account. That is how bad this movie was, it made me want to contribute to a lower rating. I would rate it negative 10 if I could. Anyone who tries to sell it as an allegory should never be allowed to review anything ever again. I respect everyone's opinions, but don't even think about trying to sell it with that justification. Literally the worst excuse for a movie ever. If you want to sit there for 2+ hours with WTF face, please see this movie.",
    "rating": "1"
  },
  {
    "title": "Mother Nature, and how we are killing ourselves.",
    "content": "A lot of the fake reviews here are from people with ignorant, political perspectives. They want you to hate someone's piece of art based on their own emotional issues toward an actor or idea.The film is a true work of art, displaying US and OUR collective, destructive behavior, right in your face! Darren doesn't care what you or some critic thinks, he did this because he had to. We are killing ourselves and our MOTHER and this is an artful yet harsh, radical reminder of that.Watch this film so that more chances can be made in Hollywood. We are also killing our children's brains with all of the comic-book junk they usually make and artful films like this don't and won't get chances to be digested without support.",
    "rating": "10"
  },
  {
    "title": "A masterpiece of overindulgence",
    "content": "In this Darren Aronofsky (Black Swan, Pi) written and directed film, Jennifer Lawrence (Hunger Games, Silver Linings Playbook) and Javier Bardem (Skyfall, No Country for Old Men) star as Mother and Him, the couple in question. First Man (Ed Harris: Gravity, A Beautiful Mind) and then Woman (Michelle Pfeiffer: Stardust, Scarface), a thinly veiled Adam and Eve, invade their space, then their sons Oldest Son (Domhnall Gleeson: The Revenant, About Time) and Younger Brother (Brian Gleeson: Snow White and the Huntsman, Assassin's Creed), followed by more and more until they are overrun.Despite excellent acting from Lawrence and Pfieffer, Bardem sadly is less convincing, the film is an exercise in overkill. From the burned heart turning into a crystal (it would really turn to ash that would float away) to the patch of blood shaped like a vagina that refuses to go away, this is a film that wallows in self- indulgence and, despite what some critics may say, lacks originality. Anyone that knows their bible can see the Cain and Abel and the plagues etc. but the allegories and imagery he has taken from the Bible are ruined by deliberate shock tactics, robbing them of any true meaning leaving a film of no substance where nothing really happens. If it was supposed to make me think, I am afraid all it left me with was 'there's 121 minutes of my life I won't get back.'",
    "rating": "2"
  },
  {
    "title": "Story of Life from a Religious Perspective",
    "content": "Him is the God, the creator! Mother is the mother earth. Mother gives form and maintains the structure. God first invites Adam (the old man). Then from Adam's rib God creates Eve. Do you remember the scene in which Man's rib was wounded and he was throwing up?Adam and Eve break the forbidden crystal (they ate the forbidden fruit).Then we see the story of Abel and Cane. Cane kills Abel. Then mother's house, the earth, is populated with various religions and various ideologies. All of which pray God (or Him). But they become aggressive. They start to betray the earth. And then the story of Jesus. Mother becomes Mary. It gives birth to Jesus. But Jesus followers eat him alive. They eat his blood and his flesh (wine and bread). And the story continues. The way the humanity is heading, Mother earth is doomed.I liked the symbolism in this movie. But to me, as a semi-Nietzschean thinker, mother is the real God. For God is not separated from mother. God is mother's creation. Mother = Earth. I finish with this quote from Nietzsche:\"Remain faithful to the (mother) earth, my brothers, with the power of your virtue. Let your gift-giving love and your knowledge serve the meaning of the earth. Thus I beg and beseech you. Do not let them fly away from earthly things and beat with their wings against eternal walls. Alas, there has always been so much virtue that has flown away. Lead back to the earth the virtue that flew away, as I doback to the body, back to life, that it may give the earth a meaning, a human meaning.\"",
    "rating": "7"
  },
  {
    "title": "Self Indulgent disappointment ..",
    "content": "It's just a pretentious main stream approach to putting a female thru torture and horror for no reason and with no happy ending, like so many B movies accomplish on a regular basis these days.. Jennifer's character really has no chance, no choices and only has a personality of just another on screen screaming damsel in distress. Regardless of what anyone says, it's just a Rosemary's Baby clone, just with a different finale that suppose to make the audience believe otherwise. All the secrecy leading up to it's debut was just to hide the fact it was always just that.I'm sure it'll get high marks from those who enjoy films with supposedly no boundaries etc,, but just because it can, doesn't make it good.. It just becomes \"Oh look at what we can do\", with little meaning other that to give a quick silly shock effect..",
    "rating": "2"
  },
  {
    "title": "Art is not shoving everything into a blender...",
    "content": "As I say in the title of my review, it is neither artful nor profound to jam every possible reference and metaphor into your movie. It's lazy. It means you have no clear direction and/or are trying to appear meaningful while being unable to resist inserting your own 'struggle' into the 'high concept'... as though you are equating yourself with the existential conflicts of gods and nature... I should think this is the penultimate epitome of pretentiousness and narcissism.Yes, I got ALL the possible meanings of everything thrust into this amalgamation of horror and pseudo-philosophy tropes. And that was the problem... they were ALL THERE. There was no one idea prevailing; it was, as other reviewers noted, throwing all the poo against the wall and seeing what stuck... and the result was merely akin to a port-a-potty explosion.The only reason I've given it a 2 was that there were so many abysmal movies this year that this one does rise a little higher by comparison... but only barely.This is a movie for all the art-house crowd who believe their own self-delusions of brilliance and the Hollywood elite who pat themselves on the back ceaselessly.I would compare it to the absurdly high praise for \"Boyhood\".",
    "rating": "2"
  },
  {
    "title": "Comedy Of Horrors, perhaps",
    "content": "Maybe the intention was to make a terrifying comedy about, about, about...well, I'm not sure. A Mother! like that with an exclamation mark? An artist with an ego bigger than their house? Who knows. I certainly tried to cling on to something but I couldn't. It seems like a terrible confession to make but the truth is I couldn't care less about that mother because I didn't believe in her plight and couldn't understand her behavior. Jennifer Lawrence is a terrific actress we all know that but here, she screams and screams while I glanced at my watch with mounting impatience. Borrowing from other, better films, doesn't help, on the contrary, it irritates. Rosemary's Baby came to mind as well as The Tenant, Apartment Zero, Common Wealth. All films that terrified me without explicit gore and superb screenplays. Mother! seems like an interesting idea totally derailed by an out of control ego.",
    "rating": "2"
  },
  {
    "title": "Aronofsky's mother! will be hated by many, but loved by a precious few",
    "content": "100Horrifying. Just.. horrifying. Aronofsky really got me with this one. Not only did he manage to grab me on an intellectual level, but also on an emotional one. This movie is going to be hated by many, I know that now. But for me, this is, hands down, the movie of the year. Every shot, cut, and scream is perfectly constructed to make an immersive atmosphere that never relents in it's uncomfortable feeling, and the acting is seriously award worthy. Javier Bardem is absolutely wonderful, and Jennifer Lawrence... oh man... her performance is absolutely top notch. At first I couldn't quite relate to her character, but as the film progressed, her mindset became my mindset, and we essentially merged into one force of fear and terror that was absolutely unstoppable until the ending. I cannot praise her performance enough in this review. Her emotions leaked from every frame she was in, and it broke my heart and scared me witless the whole way through the film. Aronofsky's pacing is immaculate as well, the whole movie feeling not a second too slow or quick, the events rolling on naturally and in a way that felt very satisfying. The whole way through, I was riveted and invested by the acting and cinematography, which is definitely Aronofsky's best I've seen so far. The entire film is gripping, horrifying, heartbreaking, and absolutely wonderful. Nothing about this movie pulled me out of it. Watching this in a theater was like being in a bomb shelter while the world ended, every sound apocalyptic and every camera shake filling my view. If you can, watch this on the biggest screen you can with the best surround sound you can afford. If you only watch one movie this year, make it this one. This movie is incredible. This is why I study the movies.",
    "rating": "10"
  },
  {
    "title": "Garbage",
    "content": "Mother! is a disaster, a car wreck and a movie abortion that lived. There are no plot points that get resolved - only plot warts and chancres that will forever make you regret that one night you had with Aronofsky. Remember how you watched years of Lost and toiled over the minutia seeking clues and resolutions that never came? Yup. Except at least there the ride had it's merits. This, however, is a journey down a cinematic hole akin to a journey through a broken car wash... over and over. You hear the gears clanking. You hear the water flowing... somewhere. And the whole time you think, \"This makes no sense... but the reveal, the twist, the wrap-up will be epic!\" Nope. Zero. And if anyone sugar-coats this or tries to say, \"well, you just didn't 'get it,' either kick them in the nuts or boob punch them for failing the \"is-that-dookie-or-chocolate-cake\" test. This is *clearly* dookie. There is NO cake. There is NO PRETENDING that this is cake. The trailer pretended this is cake. The trailer lied. This is not a horror. This is 2 hours of \"just how uncomfortable can we make Jennifer Lawrence appear?\" The truth is bit like letting your 3-year-old into the kitchen to cook. You will find a bowl of cereal and ketchup, milk and raw fish, flour and dry Cool Aid powder and a hundred other ingredients - that when used separately and in any other setting might make a meal. But here they just make a mess. A disgusting, boring, unresolved ass fest.",
    "rating": "1"
  },
  {
    "title": "Fierce debate, how wonderful",
    "content": "I have a nagging feeling that the raves come from people in their 20's and/or younger. I maybe wrong but the debate erupting from this movie reeks of youth. Something similar happened with Terrence Malnick's The Tree Of Life. People either loved it or hated it. From my own personal POV the only different between The Tree Of Life and Mother! is that The Tree Of Life was a masterpiece without any visual cope outs and, perhaps, the only commercial concession were in big star names but even then Brad Pitt gives one of the best performances of his career. Mother ! Is not a masterpiece, not to me anyway. I couldn't connect. Was it a comedy of the absurd? When I saw all the people dancing and partying in the house I had a flash back to Blake Edwards's \"The Party\"Jennifer Lawrence is a truly gifted actress and beautiful to boot and, quite clearly, she put herself in Darren Aronfski's hands, She, the mother, calls out \"Baby\"? Hoping to find her husband - She is a Saint Joan half burned already. That truly puzzled me. Can you please give us time to connect with her? A few minutes. If you remember Mia Farrow's Rosemary - She was, emotionally, so far away from what she's about to confront. Polanski takes the audience through her journey and we're with her, every step of the way. What makes it so terrifying is the veil of normalcy that surrounds the proceedings. In Mother, the surreal takes over the atmosphere and destroys it. We can keep a distance without really participating. The same can be said of Ed Harris and Michelle Pfeiffer - They are a welcome, semi-camp addition at the perfect time and then, they disappear. The glory of Ruth Gordon and Sidney Blackmer in Rosemary's Baby is that their intrusion is taken all the way through to extraordinary results. And Javier Bardem/John Cassavetes? If you're interested watch Rosemary's Baby again like I did last night, 24 hours after seeing Mother!and then you tell me. In my modest opinion one is a flawless masterpiece the other is just okay.",
    "rating": "5"
  },
  {
    "title": "Moab (Mother of all Box-Office Bombs)",
    "content": "These days, we live in a world where most things are terrible and don't make any sense. Yet, a film like Mother! can still come along and disgust audiences. A film so off-putting, Rex Reed declared it \"The worst film of the century\". Make no mistake, Mother! is a profoundly polarizing film. But that is only because it went mainstream. It stars mainstream actors. It's distributed by Paramount. In recent years, the art-house and the multiplex have never crossed paths. But as the era of the blockbuster fades away, it was only a matter of time for Hollywood to return back to it's roots. To bring us back to the late 1960's, where most films meant something. Films that grab you. Films that push serious boundaries. I rarely leave a theater shaken. But Mother! did just that. It is a beautiful, terrifying assault on your senses.Jennifer Lawrence and Javier Bardem play a lovely couple. Bardem is a struggling poet, while Lawrence tends to her house obsessively. Everything seems fine on the surface. What's that, you ask? The house has a heart! I admit the deed! Tear up the planks! Here, here! It's the beating of his hideous heart! ... and scene. Thank you for indulging me. No seriously, the house has a heart.. and internal organs. It's a living entity. I heard of the phrase \"Home is where the heart is\" but this is ridiculous. Is it? Lawrence plays someone that wants to be a mother to something. Her house? What happens when adoring fans come rushing in to see Bardem? Unwelcome visitors all! They wreck the house and impede on Lawrence's hard work. This must not go on. To fill the void, Bardem and Lawrence conceive a child. As the days go on, the guest list becomes bigger and bigger. By the film's midpoint, the house becomes a small city of thieves and squatters. After that, I must not share anymore. Because if you're already confused by what I'm telling you.. you don't know what confused is, my friend.How does one interpret Mother! It's the quintessential art-house/midnight movie. Therefore, anything is plausible. Aronofsky intended it that way. He juggles many concepts and critiques about life itself. Motherhood, paranoia, fame, claustrophobia, selfishness, lust, rage, war, peace, religion, gender, history.. Mother! is whatever you want it to be and more. If you know that going in, this will be a breeze. If you don't, you will loathe every second of this film and I won't blame you. It is a lot to swallow. The climax of the picture is well orchestrated insanity. Arguably, the most intense sequence of events captured on screen since Children of Men. By comparison, Requiem for a Dream is almost entirely palpable. You sit back in your seat and think \"Enough already. This is too much. Wow. It's not stopping. Please stop.\". But that is precisely the point. Aronofsky does not let up until you are mentally drained from watching. But at least to ease some of the pain, you see a lot of Jennifer Lawrence's face, up-close. Most of the film is on her face. In real life, she is in a relationship with Aronofsky. Coincidence? No, not a coincidence. This is the mark of a filmmaker madly in love with his star. On an emotional level, that shows.Mother! is not a film to go into blind.. but that certainly helps the experience. Polarizing, disturbing films are not crowd pleasures by any stretch, but that's never been an area that bothers me. Films like these fascinate me. Their lack of decorum fascinates me. The reactions from the audience fascinate me. On Lars Von Trier's best day, he couldn't have conjured a film like Mother! .. and if he did, he would've have let it be seen in a shopping mall.",
    "rating": "9"
  },
  {
    "title": "Beyond Brilliant",
    "content": "This movie took my breath away. When the end credits began to roll, all  I could think of was just how brilliant this film is! I was  absolutely astonished by the level of craftsmanship on Darren  Aronofsky's part, and just the sheer complexity of the writing.  Aronofsky says he wrote the screenplay in six days, which just blows my  mind. It is so intricate and delicately designed, that I don't know how  he was able to write it in less than a week. I think it just goes to  show how much of a pure genius Aronofsky is. This is a movie that is  driven 100% by its story and its screenplay. Everything else, from the  camera angles, to the score, to the performances, are in service to  that script. So it's hard to sit here and say \"Oh, well the  cinematography is gorgeous\" or \"Jennifer Lawrence is fantastic in the  film\", because their purpose was not to stand out on their own.  Everything they did was to enrich and drive forward this story, and  that doesn't necessarily work for every film, but it absolutely works  here. This film is made by the deep complexity of its metaphors and  allegories, and by its social and theological analysis of our past,  present, and future. Without the strength of its script, mother! would  fall apart. Luckily, Aronofsky has crafted a masterful screenplay that  works and plays on so many different levels...",
    "rating": "10"
  },
  {
    "title": "Save your money.",
    "content": "Films like Mother! have a tremendous negative effect on our psychological and spiritual level. But if you are an evolved person, and not your everyday unconscious zombie, you will avoid it. If you thrive on bombarding your consciousness with horrific sounds and images, then run to watch this film, it will continue to lower your consciousness level and make you numb in body, mind and spirit.While I applaud the acting, this film takes you on a horrific psychedelic journey. You want to laugh at the absurd, and vomit through the rest. The scenes become quite convoluted, disgusting and without depth, as if the story was written in a hurry. If you are one that does not believe that our thoughts and feelings create our tomorrows, then enjoy this film and poison your consciousness.\"We must try to find a way to forgive them all\", says the Javier character in the film. This offered a glimmer of hope, but nah the writer wants you to believe that if there's no forgiveness, then they get to do it all over again, an infinite loop of misery. Speaking of misery, as I was watching the film, I wondered if the writer/director harbored a great deal of sorrow inside. Clearly this man feels that the core of everyone in this world is evil. Which is only a reflection of what is inside of himself and perhaps the people who funded this film. You become what you focus on. What a waste of good talent.",
    "rating": "1"
  },
  {
    "title": "The worse film ever I've have the misfortune to watch",
    "content": "What a load of clichéd, self absorbed, confusing, unhinged, idiotic, boring and predictable waffle this was.This 'film' has no coherent narrative or plot, it's just a mish mash of the directors ideas and plans for several different films all sandwiched into this 2 hours of misery.How ANYONE can enjoy this pile of twaddle I don't know. Form Jennifer's pathetic plodding about her house barefoot ( coz she's pregnant). To her husband being a frustrated writer (yawn) who's lost his mojo and inspiration to write (double yawn) it's all just so expected.In the premier last night people were laughing at this film, not with it. I walked out just as the semi automatic weapons were discharged....I mean, really?This film was supposed to be applauded that it was written in 6 days but in actuality it's so bad you KNOW it's been written in 6 days.Awful awful awful. I'd be so embarrassed if I was an actor in this film, it's was cringe to the max.",
    "rating": "1"
  },
  {
    "title": "Trigger Warning",
    "content": "\"You never loved me. You only loved how I loved you.\" ---mother (Jennifer Lawrence) to Him (Javier Bardem)Directed by Darren Aronofsky (\"Black Swan\" and \"Requiem for a Dream\") \"mother!\" is possibly the darkest, most disturbing movie I have ever seen.It is absolutely one of the most affecting.Reviews have been mixed, to put it nicely. But I think the theme of \"mother!\" terrifies some people so much that they choose to be perplexed by it rather than allow themselves to even think about what Aronofsky is suggesting.My take on the film is that it is about God, humans, and our respective relationships with creation and the creative process.Humans are trying to create Heaven on Earth, and God is....well....God created our ability to create. \"mother!\" is about the futility of OUR attempts.It is about nihilism.It is the abyss, looking back at us.Congratulations to Darren Aronofsky: He got it on film. ⭐⭐⭐⭐⭐⭐⭐⭐⭐",
    "rating": "10"
  },
  {
    "title": "A beautiful roller coaster",
    "content": "The movie is portrayed by it's trailer as a horror film and rightly so, humanity and the themes this movie explore are horrific. I can't say I enjoyed this film, there are some difficult scenes and this is a movie like say Clock Work Orange, it will push and test you. It will make you talk and question things afterwards. This is not a casual movie to go and enjoy, it's a questionable thought provoking experience. It's rare for a film these days to evoke such thought, so many mixed reactions and to explore themes that everyone will understand differently. Outstanding acting, intelligent cinematography, just go and see it, form your own opinion.",
    "rating": "10"
  },
  {
    "title": "Terrible Waste of Acting Talent! Not Worth the Time!",
    "content": "My husband and I awaited this movie with great anticipation. We both feel that Javier Bardem is one of the best actors of our time, and love Jennifer Lawrence, Ed Harris, and Michelle Pfeiffer! We saw the film three days after it opened and were one of two couples in the theater (a total of 4 people in the cinema!); the other couple left halfway through the movie. In retrospect, we should have gone with them.Seldom (if ever) have I seen a film with so little dimension! How Aronofsky could be so pretentious as to claim that the film was about climate change and that Lawrence represented Mother Earth is beyond me! Clearly a victim of her husband's unrelenting narcissism and emotional abuse, her character was more symbolic of a door mat!The movie raised many more questions than it answered (not to mention, \"Why did we waste our time and money?\"). What was wrong with Ed Harris and why was it significant? What was the yellow powder that Lawrence took whenever she had an \"attack?\" Why did Lawrence dumbly accept Bardem's comment \"Where will they go?\" whenever she encouraged him to oust Harris and Pfeiffer (he was a doctor, and they had grown kids worrying about their estate, after all)? Of course, the overriding question is \"What was the point?\" To refer to this pompous rhetoric as drivel is to insult drivel! After wishing the end of the movie would hurry up and arrive, we left the theater thinking that we had just thrown away 2 (long) hours of our lives that we could never get back. Easily one of the worst films we've ever seen!",
    "rating": "1"
  },
  {
    "title": "Mother Of Intentions",
    "content": "Try to imagine Darren Aronfski with all his talent, preparing Mother in silence working with great actors, re-polishing the script and without the weight of a huge budget. I'm sure Roman Polanski had pressure from the studio to make concessions here and there but look at Rosemary's Baby and tell me. What concessions? I heard Martin Donovan, the director of Apartment Zero, a few months ago, explaining why he hasn't made an American film in 20 years. It was an explanation I'll never forget. He didn't blame anyone or anything, there was no blame of any kind but a deep and I should say, humble reflection and the fruit of his reflection was expressed, beautifully, in his excitement as he prepares his next film. I remembered his words as I watched Mother! Try to imagine Darren Aronfski with all his talent, giving time for the baby to be totally form and ready to be born. Working with great, new, unknown actors, without pyrotechnics but just the truth within the symbols (if any) - I love Jennifer Lawrence and I would have loved to see her play this role at the time of Winter's Bone - regardless of her youth. I believe that small private dreams/nightmares should be told with a feeling of privacy. Think Roman Polanski himself played the meek tittle character in The Tenant and the journey in Mia Farrow's eyes throughout Rosemary's Baby, Colin Firth's invisibility in Apartment Zero. In Mother there is also a Luis Bunuel touch from The Exterminating Angel but in Bunuel we live the surreal mystery with all our five senses. In Mother, we keep questioning, at a distance. No matter how close you come with the camera. Jennifer Lawrence is lovely but she starts with fear in her eyes and she stays there throughout. Javier Bardem is a sloppy variation of John Cassavetes in Rosemary's Baby. Ed Harris, as usual, superb as the Sidney Blackmer of the situation and Michelle Pfeiffer, who provides the biggest and most welcome surprise in a character clearly based on Ruth Gordon's Minnie in the same Polanski masterpiece. For all of the above I felt, sitting through Mother! A long and irritating experience. Now, I'd like to set a complaint about this, who shall I call?",
    "rating": "4"
  },
  {
    "title": "You are mostly all ignorant humans :) Darren Forever.",
    "content": "This movie is a genius masterpiece. It is mind blowing and the concept and meaning is confronting. This movie made me feel none like any other movie I have or will ever see. If you think the movie is terrible or a waste of time you do not understand the meaning of the whole movie! The reviews are very frustrating and stupid, most of the viewers don't understand the themes and over all analogy. This movie is not for everyone, majority of the people watching are very narrowed minded. If you can't wrap your heads about the under lying themes and subjects go watch a comedy movie.Please don't waste MY time reading these stupid reviews, I want to see the thoughts of people who actually understand this movie and want to talk about this massive issue!",
    "rating": "10"
  },
  {
    "title": "Jennifer Lawrence is the most overrated actress in Hollywood",
    "content": "As the eponymous 'mother', Jennifer Lawrence confirms her status as the most overrated star in Hollywood. She completely takes me out of the film with her blank stare, and hammy, overbaked reaction shots.I would rank 'mother!' up there as one of her most miscast roles, along with an embittered housewife in American Hustle (Lawrence was decades too young and tried to overcompensate for the lack of life experience and talent by over-acting and screeching) and Silver Linings Playbook (Lawrence's simplistic interpretation of a person suffering from mental issues, by screaming and looking dead behind the eyes, stole an Oscar from the truly deserving Emmanuelle Riva).To this day, Lawrence's Oscar is the most undeserved, the most egregious case of a terrible, shallow performance beating a terrific one in Riva's superhuman transformation.Darren Aronofsky is to pretension what Jennifer Lawrence is to bad acting, so he clearly think he has something to say with 'mother!', and licentiously wastes our time in doing so. But ultimately, his film is as ropey and creaky as the house Lawrence and Bardem's characters inhabit. Ultraviolence is thrown into the mix into the third act in an attempt to evoke a response from the audience, but the allegories are all a bit try hard and on the nose. The result is a maelstrom of GCSE-level metaphors where nothing makes sense that is difficult to watch because it is so sophomorically executed.The film gets 2 out of 10. 1 star for Michelle Pfeiffer's villainous turn, which evoked more of a visceral response in me than Jlaw's nativity play-esque acting could ever dream of doing. Another star for the ubiquitous Domhnall Gleeson, bravely playing against type and unafraid to bare his teeth.Don't waste your time with this.",
    "rating": "2"
  },
  {
    "title": "Not what people expect from a horror movie.",
    "content": "Normally, horror movies traffic in fear of being startled.The feeling is similar to talking with someone who says \"I'm going to jump at you\" and then keeps up the threats: \"you'll be startled, just watch... I'm going to make a loud noise... you'll not know when...\" That's annoying, but not very genuinely frightening, not any more than a champagne bottle in a dark room. This movie instead confuses, frustrates, and deeply unsettles you. The logic in it is absurd and dreamlike. I've never come as close to having a nightmare while I was awake. That's not what the average person wants. It's hard to enjoy a movie like that if you think you're smart so you spend time poking holes in absurd logic that is up-front about its absurdity. It's also hard to enjoy if you are in some other way dense or unempathetic. An average person looking for an engaging series of loud noises would be very upset with this movie.I've not seen anything in theaters as bizarre and upsetting as this. It's very stressful. I hope it makes money. I want more directors to take risks. Aside from the buzz, I'll say I've never been as moved by a movie. It captures powerlessness perfectly. It is the best movie I have seen.",
    "rating": "10"
  },
  {
    "title": "Jennifer Lawrence Hubris",
    "content": "I thought this was worth its salt even though it did tend towards  cliché as it wore on.  The disappointing aspect of this film is that Jennifer Lawrence somehow  portrays an ego that is beyond the character. It's a kind of \"you know  that I know I'm only acting this and the real movie is me\" that seems  to have perpetuated in every film she had made since Silver linings  Playbook, bar X-Men (when she was covered in paint and having to \"live  in\" the previous \"humble\" shoes of Rebecca Romijn) and American Hustle  (where she was greedy White Trash).  She needs a director who can \"humble her down\", in the same way  Eastwood did for Jolie in Changeling, so that her ego is less of a  distraction for her acting.",
    "rating": "7"
  },
  {
    "title": "Pretentious Garbage",
    "content": "When the viewer sees the names of Jennifer Lawrence, Javier Bardem, Ed Harris and Michelle Pfeiffer in the credits of a movie, he or she will certainly expect at least a good film. Unfortuntelly this is not the case of \"Mother!\", a bad trip of Darren Aronofsky. Maybe if the viewer is on drugs or is a pretentious intellectual, he or she will say that has enjoyed this garbage as if it were a masterpiece. But it is not! Indeed is another overrated film in IMDb and a complete disappointment for most audiences. My vote is one (awful).\nTitle (Brazil): \"Mãe!\" (\"Mother!\")",
    "rating": "1"
  },
  {
    "title": "Easily the most intense move I've ever seen",
    "content": "Holy. Crap. I am shaken - mentally, and even physically. This is my first IMDb review, in part because I can't believe the negative reviews. Anxious (good word to describe my current state) to check back once it's widely released. The first half of the movie, I believe, is intended to get you riled. By the second half, if you're like me, you're trying to figure it out - WHAT DOES IT MEAN?! - and when you get it, you won't stop thinking about it. What a masterpiece. Here, take all my money - I'll definitely go back... once I've calmed down!",
    "rating": "10"
  },
  {
    "title": "A little tedious to watch, but the concept is brilliant",
    "content": "Some people would say you have to be a genius to make films like Darren Aronofsky does. I would also add to that that you have be a genius to watch and appreciate his films. By the end of 'Mother!' I felt like I had been hit by a truck. The film is almost hypnotic in the way it beats you to your knees and keeps you there for the entire run time. It's a film that almost doesn't want to be liked if that makes sense. The less you like it, the better it has done its job.Without discussing the metaphor this would be a very hard film to review (because that is in essence everything), so let's get into some spoilers. As I understand it, Javier Bardem's character is 'God' or 'Him' as he is listed in the credits. The film serves as a commentary on how (according to the Bible at least) all God wants is attention and to be loved, no matter how many people in the real world have to be destroyed, killed or blown up for him to achieve that.Now, to say that's a controversial subject to make a film about is an understatement. But you have to respect Aronofsky for being bold enough to take that plunge. There are some brilliant film makers working in the world today, but when you consider their career paths, a lot of them have played it very safely.'Mother!' is quite a tough film to review. If you judged it purely on its watchability factor you'd probably have to go quite low. If you judged it purely on the metaphorical story it is trying to tell, I think you'd have to consider it nearly perfect. I've decided to rest somewhere in the middle with an '8'. The only thing I can safely promise that you'll find about this film, is that it's utterly unique.",
    "rating": "8"
  },
  {
    "title": "Spies in the house of love?",
    "content": "\"Mother!\" follows a couple (Lawrence and Bardem) who live in solitude in an expansive farmhouse that the wife has painstakingly restored from a fire. One evening, they are visited by a doctor (Ed Harris), whose wife (Michelle Pfeiffer) follows. The dynamics of the home are turned upside down, and chaos ensues.I won't attempt to give a full plot summary here, as it's truly a waste of time. If the cryptic promotional materials and slim premise are enough to intrigue (as they did myself), then give the film a go. The first half of \"Mother!\" is just shy of brilliance, with bizarre character interactions, wry humor, and phenomenal performances from all involved. At times, the dynamics between Lawrence, Bardem, Harris, and Pfeiffer give one the sense that they're watching a zany stage play, and the actors (especially Pfeiffer and Harris) clearly have a ball with this. As the film progresses into its second half, it shifts and expands in ways that are unabashedly over-the-top, and Aronofsky quite literally pulls the rug out from under his audience. The film is stuffed with metaphors that are clearly Biblical, but there are numerous bents and other influences spilling in, most notably \"Rosemary's Baby,\" which seems to be a prominent influence Aronofsky wears on his sleeve here; that said, \"Mother!\" is a very different film from it. The second act is chaotic and grotesque, and it's effective up to a point, but it brazenly crosses the line that the first act so cleverly toed; and perhaps that's the aim here, but it's not as enthralling as what comes before it. Overall, I found \"Mother!\" at times riveting and consistently well-acted. It moves from being delightfully off-kilter and sinister to fiery pandemonium, the latter of which doesn't have the same consistent pull as the former. It is no less a thoroughly weird and engrossing epic that demands attention, but I personally found the second act to run itself thin. 7/10.",
    "rating": "7"
  },
  {
    "title": "Wish I could have the time back it took to watch thi movie.",
    "content": "This movie is terrible, I was excited to get to see it before the wide release. However, once it started I couldn't wait for it to be over because it was cliché after cliché taken from much better movies and smashed into this one. Jennifer Lawrence was OK in the X-Men movies and Hunger Games but this is out of her realm and she does not add anything to this movie, in fact I think she takes away from it.",
    "rating": "1"
  },
  {
    "title": "A shocking off the rails metaphorical art house film",
    "content": "Wow mother! was a real wild ride. I stumbled out of the theater in awe. I don't think I've ever seen anything quite like it. It is really nice to see directors like Darren Aronofsky take chances like this. What you get in mother! is one part drama one part horror six parts insanity. The story does not take any time at all to get going, it becomes completely crazy about an hour in and the final 20 minutes will leave you shocked. While I was not totally floored by either main stars performance the acting was surely great. The problem with mother! is, taken at face value it's totally ridiculous. The things that end up transpiring are absurd and over the top to say the least. Therefore mother! will surely be a polarizing movie. As a small example I went with 3 other people to see it, including myself it was a 50/50 love hate outcome. As far as the shocking moments in the film, they are a real doozy. There's one scene in particular that will certainly repel some people. In my theater of about 20 or so people a woman basically ran out during this part. When we left she was waiting outside visibly shaken and yelling at her boyfriend. For me as a person who loves it when films push the envelope and cross boundaries, I was delighted by it all. While mother! is the most audacious original movie of 2017 taken at face value it could be a real bust for some people. After reading into the meaning of the film I'd say I like it even more. I'm giving it an 8/10. A great movie.",
    "rating": "8"
  },
  {
    "title": "Retarded Cringefest",
    "content": "Javier Bardem's character is way too unrealistic in this film. He lets some old guy, who he doesn't even know, inside his house and allows him to sleep in the house. Next day, that old guy's wife shows up and starts acting awkward around Jennifer Lawrence and Javier Bardem. Next thing you know, the old couple's sons show up and start arguing about money and some will (or whatever). The two brothers start fighting each other and one kills the other (LOL!) and starts say \"they favoured him over me.\" What a retarded plot.Javier Bardem's character feels so sorry for the old couple for losing one of their sons that he lets the old couple invite a ton of people into the house and start partying.Jennifer Lawrence gets pregnant by her husband and more weird shlt starts happening. More and more people start showing up at their house. Taking pictures, shouting, partying, and tearing up the house. The people were literally taking everything in the house.More and more random things happen in this movie nonstop. It's ridiculous.After Jennifer Lawrence gives birth to her son, Javier Bardem takes the son and lets his cult-like fans have the baby. A couple of seconds later, the baby is dead and sliced open, the crowd is eating the baby. LMAO! Can this movie get any more retarded? Jennifer Lawrence's character sets the house on fire and Javier Bardem's character doesn't have a single scratch on him. He literally takes her heart right out of her chest, killing her, and there's a diamond looking thing inside her heart that's identical to the diamond looking thing in the very beginning of the film.The ending of the film is the exact same as the beginning of the film except Jennifer Lawrence's character is played by a different actress.This movie has the most retarded story ever. It literally makes zero sense. And this movie isn't complicated in a very good, smart, and artistic way, I mean in a really fvcking stupid way.Total waste of time and money. I have no fvcking idea why Jennifer Lawrence is one of the most praised actresses of this decade.",
    "rating": "1"
  },
  {
    "title": "Badly Executed Cluster Of References",
    "content": "First of all, Casting of Jennifer Lawrence in this film was awful. All the Hunger Games crowd is going to want to see this film just because she's in it, and they simply will not get it because they're dumb. Not only that, but she can't pull off a performance to sell a film like this. I found Javier Bardem's acting really disappointing as well. Obvious inspirations include Rosemary's Baby, some Eyes Wide Shut and it has a Lynchian vibe. And while I can appreciate Aronofsky's point of references, this is by far the most disappointing of his films. Neither one of the characters were engaging or likable. There are obvious biblical references and social commentary throughout the film. But I found some scenes, situations and acting really hard to take seriously. I appreciate that while the film sets its tone and obvious comments really nicely, there are many interpretations that viewers can create for their own. The third act is intense (kind of hard to take some parts seriously) but really rushed and forced. The film is really badly paced and has a predictable ending. Though it treats itself as a modern masterpiece because of its commentary on the relationship between humanity and nature. Really disappointing.",
    "rating": "4"
  },
  {
    "title": "The worst I ve ever seen",
    "content": "So many people like it... Please Kim Jong-un , press the red button !!! They say it is a metaphor about God , Adam and Eve and the story of the overpopulated earth to the destruction and rebirth . I say it is a metaphor for a bloody stupid totally idiotic movie made by sick people for sick people. The worst I 've ever seen in my life especially the second part.",
    "rating": "1"
  },
  {
    "title": "Absolute garbage!!!!!!!!! and that is an understatement.",
    "content": "Absolute garbage!!!!!!!!! and that is an understatement.what in the God's name (or not) do these people think(or not) when they make these movies.Nihilism as the possible topic of discussion and expression baffles me. these movies have no emotional, moral or sentimental value, one is disgusted half way through and from there on its just a useless crap of imagination from someone who definitely is a misguided and disturbed soul.",
    "rating": "1"
  },
  {
    "title": "Aronofsky stepped a little too far out of the box",
    "content": "What the **** did I just watch? Darren Aronofsky is notorious for making some seriously strange movies. Mother! is no exception to the rule and even takes it to another level. Which I'm not sure is a good thing. This film is certainly geared more towards a niche audience looking to wrack their brain on allegories and I'm surprised it wasn't a more limited release for that reason. I'm not calling the general public dumb, but studios tend to shy away from releasing movies like this out of fear that they won't get return on investment. The story begins with a woman and her husband (no, they don't have names) who live in a home seemingly in the middle of nowhere. Their tranquil existence is interrupted by visitors with questionable motives. Let's take a closer, spoiler-free look at Mother!The Good: Darren Aronofsky films like to play with your senses, and that is exactly the case with Mother! This film really appeals to them as you hear every floorboard creak, every exasperated breath and even the pulse of the house. This helps build tension and set the mood for events to come. It gives you that gut anxiety feeling when you're hearing every single little noise as things around the Mother gradually become more chaotic. This makes the breaks of silence eerie in a way, because you become so used to the white noise around her.The Bad: I'm sure there are going to be people kissing Jennifer Lawrence's ass for the next year or so because of her performance. But I was bored with her character and irritated with the way she and others were written. I understand that they were all intentionally written this way to deliver a story, but the characters responses to certain situations just seemed so unnatural. If anyone showed up at my door in the middle of the night, it would have to be a seriously extenuating circumstance for me to let them stay. When others showed up, I'd probably be throwing punches. Maybe that just makes me an asshole, I don't know. I could sympathize with the Mother, but I was hard pressed to find a character that was actually likable in any way.The pacing of the film seems painfully slow and makes an already long movie seem much longer. I don't need fire and blood raining around me to be entertained but there were only a couple big moments that really got me engaged. Aronofsky has done it right before by balancing drama, suspense and even a little horror (IE; Requiem for a Dream, which if you haven't seen you should). Mother! has all these elements but they seem disproportionate, which tends to make things drag quite a bit.From start to finish, this film keeps you guessing as to what the hell is going on. The world that the mother and him (Javier Bardem) live in seems to be something out of a dream, yet it could really exist. I really enjoyed the mysterious aspect of the film but I also felt somewhat misled. The trailers made it seem as if this was going to quickly devolve into a devil baby movie, but believe me you're going to be far more confused than that.So, is too weird a bad thing? I'm occasionally down to watch an indy, artsy film but a few ride that line of being outright strange. This movie tore right through that threshold and actually made me wonder that question; is too weird a bad thing? In some cases, yes. It appears to be a cohesive story but I was constantly asking myself if any of the film is really supposed to be happening or if it's some sort of hallucination. It's not strange like goats talking or anything like that, but just the behavior of the characters and the general setting seem peculiar. In Aronofsky fashion, the last fifteen minutes of the movie will probably leave you horrified and when it's all said and done you're going to feel like you just snapped out of a dream. Nevertheless, there's a message to be gained from the movie and it's an interesting ride to say the least.The Judgment: I honestly walked out of a dead silent theater not knowing what to think or say about the film, guessing that others around me felt the same way. It took me a little bit to digest the message and make sense of everything that I saw. If sensory stuff or artsy movies irritates you, I wouldn't recommend seeing this film. If your curiosity has gotten the best of you or you're a fan of indy films, go check it out. Personally, I didn't like this movie much at all, but I've seen and enjoyed a few other Aronofsky films so I'm just chalking this one up as a fluke.",
    "rating": "4"
  },
  {
    "title": "The weirdness of 'Mother!' has to be seen to be believed",
    "content": "'Mother!' is a perfect example of a film that raises such high hopes with one of the best and most disturbing trailers (every bit as much as the trailer for 'IT') of the year, yet turns out to be the complete anti-thesis in quality making it one of the most disappointing, and to me the strangest, films of the year.It is really sad for me to say this about 'Mother!' Appreciate Darren Aronofsky very highly, though totally get why his films don't click with all viewers, and really liked to loved all his pre-'Noah' films, especially 'The Wrestler' and 'Requiem for a Dream' ('Black Swan' was also great, and while it is one of his more polarising films likewise with 'The Fountain'). 'Noah' for me was a real disappointment, though it was nowhere near as bad as the initial audience response on IMDb (which was of vitriolic hate with severe objections to how the 'Noah's Ark' story was treated).To me, 'Mother!' is Aronofsky's worst. Was expecting to be terrified and riveted but ended up being perplexed and left completely cold. Although the trailer was one of the year's best, it turned out to be one of the most misleading. Is 'Mother!' irredeemable? No, absolutely not, Aronofsky's films are at least extremely well-made and crafted and he often gets great performances out of well-chosen casts, even if there are other aspects that don't connect. Could it have been much better? Considering it had Aronofsky's name on it, that most of his previous films are examples of great film-making and that it had talent like Jennifer Lawrence, Javier Bardem, Ed Harris and Michelle Pfeiffer, yes it should have been much better.Where 'Mother!' fares strongly are in the visuals and the acting, pretty much the film's only near-uniformly good assets. It's a wonderful-looking film, especially in the agile and truly unsettling cinematography that gives a real disconcerting sense that there are things constantly lurking around. The production design is audacious and creepy, the house like an increasingly opening up character of its own, the lighting is rich in atmosphere and the aesthetics are more than accomplished.Jennifer Lawrence sheds her usual quirkiness and feistiness, and gives a more vulnerable edge here which is not just wholly convincing but also very moving. Michelle Pfeiffer stands out in support in a truly startling turn, likewise with Ed Harris and their chemistry is far more interesting than that between Lawrence and Bardem. Domhall and Brian Gleeson (sons of Brendan) do very capably with little to do.Aronofsky does bring some dynamic to his directing, if more in the style and atmosphere than in the storytelling and content.However, 'Mother!' really is let down by that it feels incredibly muddled. Throughout there are a mishmash of tones, whether it was horror, thriller of a psychological kind, allegory and perhaps torture porn, and it all felt thrown in with not much thought in what to do with them. There are moments of an unsettled vibe, but only in spurts. A vast majority of the film has scares that are very much empty and too reliant on done to death old dark/haunted house tropes and at times unintentionally funny, the intense close ups and sudden reveals feel overused and neither provoke chills or sympathy for the protagonist (for all Lawrence's efforts).The pacing is far too sedate to be thrilling and there is nothing sensual about the film due to the chemistry between Lawrence and Bardem being so lukewarm. 'Mother's' content is obvious a lot of the time, and the symbolism and allegorical elements came over as excessive, heavy-handed and overblown. It was not the matter of not getting them, it is the way they were used that has put people off and that it is hard telling what Aronofsky is trying to say. It was also not the matter of hating things that do things differently, have seen my fair share of unconventional films and have been impressed.While Aronofsky succeeds in the stylistic elements and some atmosphere, the storytelling doesn't work here. The momentum is creaky constantly and the whole telling of it is strangely muddled at best and incomprehensible at worst. Particularly bad is the last half an hour, which descends into ridiculous and incoherent chaos and outlandishness. The dialogue is stilted and rambling and the characters are very thinly sketched, especially Bardem's, though Lawrence's is also too passive and is not easy to root for. There are exceptions to the acting, Bardem looks bored in his role and Kristen Wiig is completely out of place.Overall, a disappointing film (didn't hate it, just didn't care for it) that should have delivered on creepiness but instead delivered on excessive weirdness that it has to be seen to be believed. It is not hard to see why it has polarised critics and audiences alike. 4/10 Bethany Cox",
    "rating": "4"
  },
  {
    "title": "Devolves into simplicity from beginning to end",
    "content": "I want to state, to begin with, that even when a movie intends to be highly metaphorical and symbolic, its purpose is still to be entertaining. Mother! wasn't.If the trailer caught your eye, or if you expected to see something scary, you will be disappointed. I have strong feelings about this movie. I think it might be the worst I ever saw. They have to do with the camera work itself, the scenario, the use of symbolism and metaphor, and most of all with the abject simplicity the director fell into.First the camera work. If you are a lover of Aronovsky, you will be happy to see he hasn't changed a thing from the way he directed Black Swan. The similarities between both movies are so staggering I sometimes had the impression I was watching Nathalie Portman, not Jennifer Lawrence. It is of course an unusual and daring method used, but it ceases to function after one movie. In a way it is disappointing to see a supposedly talented director so unable to innovate and clinging to his own style.Onto the scenario. The screenplay is tremendously poor and bad. Few words are uttered, but more importantly, they lack any significance. At no point is the audience allowed a glimpse into the psyche of any of the characters due to this lack of exchange between them. Facial expressions are your only clue, and they are static throughout the movie. This is a big let down if you loved Aronovsky for Requiem for a Dream.The use of symbolism and metaphors is usual with this director, and so I expected to be fed plenty of it. Only metaphors are interesting and intriguing when they aren't so blatantly obvious. I read some of the comments here, stating that those who didn't like the movie simply didn't understand it. I disagree. It is hard not to understand that the house is alive, and the mother, ultimately, when on several occasions the main character touches it only to feel its pulse, or sees it bleed. It also isn't hard to grasp the religious metaphor there, what with the rituals in the end and the human sacrifice. This is my main objection here. The symbolism in the movie is fed to the viewer, whether you want it to be or not, instead of being suggested. Suggestions are absolutely nonexistent. So much for intrigue and suspense. There is no possibility for the audience to make up their mind about the movie's significance or its scope. This is what I call cheap symbolism, the kind you would find in a 8th grader's essay.Bringing me to my last point, the simplicity that Aronovsky fell into writing and directing this movie. Nothing was new in his camera work, the movie looks exactly like his last one, the scenario is nonexistent, the characters are plain and without any depth, the symbolism is force fed to you and the evolution of the movie isn't based on anything. This is a poet who, through his latest work, manages to stir up such a wave of fanaticism in his readers that within a single day he moves masses of followers into rage, anger, murder, human sacrifice and cannibalism. Yet at no point are we told about his writing or the power of his poetry. This is like an author telling you about a joke that would be the funniest in the world, without telling you what the joke was. It is too easy and it doesn't solve the puzzle. The metaphors are there for you to swallow, you have no choice in the matter, yet the one part of the movie that could give any sense to the intrigue is hidden from the spectator, and the only valid reason I can find is that Aronovsky couldn't find anything good enough to support his intrigue. It is cheap, easy, simplistic, and undeserving of a 7 as a general grade on this website.I sincerely hope that, as it should, his career will suffer from this.",
    "rating": "1"
  },
  {
    "title": "Pretentious Garbage",
    "content": "When the viewer sees the names of Jennifer Lawrence, Javier Bardem, Ed Harris and Michelle Pfeiffer in the credits of a movie, he or she will certainly expect at least a good film. Unfortuntelly this is not the case of \"Mother!\", a bad trip of Darren Aronofsky. Maybe if the viewer is on drugs or is a pretentious intellectual, he or she will say that has enjoyed this garbage as if it were a masterpiece. But it is not! Indeed is another overrated film in IMDb and a complete disappointment for most audiences. My vote is one (awful).Title (Brazil): \"Mãe!\" (\"Mother!\")",
    "rating": "1"
  },
  {
    "title": "Absolutely the worst film I've ever seen",
    "content": "After viewing \"Mother!,\" the latest production by director Darren Aranofsky (\"Pi,\" \"Black Swan\"), I have say, without fear of hyperbole, that it's the worst film I have ever seen. There are bad films that you know going into them will be bad, like \"Baywatch\" or \"Mr. Woodcock\" or the remake of \"Vacation,\" \"Alice Through the Looking Glass, the \"Fast and Furious\" franchise or \"Observe and Report\" or \"Mortal Bones\" or \"Bratz\" or ANYTHING with Adam Sandler.Then there are films where you think will be better than they actually are. Like \"Pan,\" or \"X-Men: Apocalypse\" or \"The Infiltrator\" and \"Why Him,\" or the leftist bag of crap, \"Captain Fantastic,\" even \"Bobby.\" But \"Mother!,\" \"Mother!\" is in a special class unto itself. I mean, it's poorly filmed, horribly written, badly edited, terribly directed, makes no sense at all and actually made me sick And it had a cast of Academy Award-winning or nominated actors, like Jennifer Lawrence, Javier Bardem, Ed Harris and Michelle Pfeiffer. Of course, since that group chose \"Moonlight\" as Best Picture, you might as well smash the award into a million pieces ...And what plot there is  and this was written by Aranofsky, too  is about a woman, Lawrence, married to a guy 50 years older than her  that would be Bardem  and they live in this dilapidated old house that Herman Munster would have been ashamed of. And he is supposed to be a poet, but cannot write since a big fire. One day, he brings home a doctor, rude Ed Harris, and his whorish wife, Michelle Pfeiffer. Of course, this Bardem guy doesn't ask his wife anything about it. He NEVER asks her permission for ANYTHING the entire movie! Uh, that's about it Oh yeah, a few more people show up, but  amazingly  they get increasingly weirder and more disturbing. Oh, and a murder takes place, the old mansion starts to bleed and Lawrence gets pregnant and Javier can write again and becomes world famous. Then more and more and more people show up at the house and destroy everything At first, I thought to myself, \"Oh, this is a variation of 'Rosemary's Baby,' you know, the strange new people interrupting a marriage, a bizarre pregnancy and a poor goofball who becomes famous.\" But it began drifting worse than the last installment of \"Pirates Of the Caribbean,\" that had Javier Bardem, too, you know.By the first 10 minutes, we wonder why the two leads were even in a passing relationship, never mind married to each other. Plus, the supporting cast is just so annoying, irritating and infuriating, and the leads are so stupid, you have absolutely NO empathy or sympathy for ANYONE. The worst thing  if that's even conceivable  is that Aranofsky films the two leads as close up as possible  yeah, I always thought Jennifer Lawrence was rather attractive, that is until I had to see every mole, hair, pimple, blackhead, whitehead, dimple and birthmark she ever had. Oh, and then it was shot in \"Selfie Vision, and uses the ridiculous, hand-held, jiggling, seizure-inducing camera technique. There is nothing real about any of the reactions and Lawrence usually takes all of it with a blank facial expression with eyes half closed and mouth wide agape ... kind of like the women in \"Sucker Punch.\" Finally, she rebels, but by then, there are literally thousands of people in the house ... THOUSANDS! People at the screening were walking out in droves ...!",
    "rating": "1"
  },
  {
    "title": "Beware of Movies with Titles that Use Punctuation",
    "content": "A ham-fisted,* klutzy, self-indulgent cornucopia of schlock.I'll leave it to others here who have done a fine job in trying to explain the \"message\" of the movie. I laughed through most of the first half of this movie and got bored through the latter half when, I guess, I should have been shocked and moved by the imagery.At TIFF, the director/writer said he wrote this out of his own \"anger\". Well, after his temper tantrum, he would have done well to take a timeout to reflect and, perhaps, to introduce some self-discipline to edit this. Instead, he was more like Little Jack Horner, who \"pulled out a plum, And said, 'What a good boy am I!'.\" In the end, is that not part of his very message: Just because he/we can, should he/we?I left the theatre thinking, \"mother f@#$r! - Did I Just Spend Two Hours Watching That?!\" Maybe that should be the movie title. Just awful.... * To say \"ham-handed\" would be too complementary.",
    "rating": "1"
  },
  {
    "title": "I will only spoil one thing and it really has no effect. But, it's something I really think you should know before going into this movie.",
    "content": "Please, please, please.. For the love of everything and your own self worth. DO NOT see this movie. I truly do not have ANY clue why there is even one single good review. I don't care if this is \"art\" or if this is all a \"joke\". This movie, and I have seen every movie out there, is the absolute worst film of them all. It's basically \"It Comes At Night\" just worse. And, don't even argue that \"It Comes At Night\" is a good movie lol. Now the so called spoiler. A cult-like crowd ends up crowdsurfing an hour old baby like he's Jesus which turns into the baby's neck breaking LOUDLY and VISUALLY. Oh and the best part... They eat the baby. That's right. AS SOON AS THE NECK BREAKS they EAT the baby. Tasty, huh? Enjoy the film.",
    "rating": "1"
  },
  {
    "title": "the last five minutes",
    "content": "of the movie were best. a guy at the top of the theater said, \"WHAT THE F**K IS GOING ON?\" really loud and several of us laughed. he was on the elevator with his friends and i said, \"that was you?\" \"yes, but the couple next to us were having none of it. they got really mad.\"\"dude. that was the best part of the movie.\"i will never watch another Aronofsky movie in the theater.",
    "rating": "3"
  },
  {
    "title": "Just save your time and money",
    "content": "What a waste of 2 hours. Jennifer has to be the most over rated actress. If not for Hunger Games she is really not an actress. This role was so far over her head. All you get is her face looking this way and that way. The story was not tight ether. This must be how Hollywood thinks, older man (48)marries a younger woman (27. Just a waste of money and time.",
    "rating": "1"
  },
  {
    "title": "If Adam Sandler and the Wayans Brothers teamed up to film \"Art Movie: The Movie\"",
    "content": "...this would be the result: a blender full of previously seen art house clichés eliciting an occasional laugh at how ridiculously stupid what just happened in front of your eyes is.If your time is precious on Planet Earth, avoid at all costs. If you have no aim in life other than to be annoyed and irritated by passive spectacle, more power to you, you have found the motherload.Some positive takeaways:Jennifer Lawrence is so beautiful to stare at and ridiculously talented as an actress. Michell Pfieffer acts perfectly as the kind of toxic older woman we all should cut out of our lives. Ed Harris is a stellar man of mystery/genial stranger. Javier Bardem is a solid macho asshole/sociopath/narcissistic artist. Interesting claustrophobic camera work.At least it didn't utilize the current lazy storytelling technique of untold minutes of AK-47s firing at random villainsoh wait, it did....I was doing my best to wipe all memories of this experience from my mind.Hey, at least the producers succeeded in suckering a bunch of us sheeple to fund their lavish lifestyles...just livin'...the dream.",
    "rating": "1"
  },
  {
    "title": "The worst movie I have seen since Punch Drunk  Love",
    "content": "Just a tedious awful mishmash of styles and no substance. I am a fan of all the main actors in this movie but it just goes nowhere for two hours. From a slow deliberate pace, to cacophony with amateurish hand held camera close ups and lots of unintentional humor. Probably the worst movie I have seen in about 10 years.",
    "rating": "1"
  },
  {
    "title": "A tonic for misogynists",
    "content": "Imagine every female stereotype that you might expect to be the subject of derisive conversation and sadly dismissed and forgiven in these politically tumultuous times as \"locker room talk.\" This film's female protagonist is depicted to possess all of them: Insecure? Check. Possessive and clingy? Check. Unable to shake off the influence of her partner's manipulation and callousness? Check. Subjected to vile and obscene treatment by other women and men? Check. There is not one single positive human character in this story other than the heroine. Her attraction to and love for her husband is never depicted in a way that helps the audience understand her point of view despite the fact that the character is on screen for every single second of the film. I am deliberately refraining from mentioning one outrageous event the character experiences in this film that is the nadir of this character's destiny as victim: you should see it for yourself and decide. In short, I found nothing in this film's story to like and found its treatment of women nauseating.And if the movie is intended to illuminate the ugliness of humanity, its existence is completely unnecessary in these times when the news feeds are full of world events that continuously report on the ugly side of ourselves. Your eyes may have seen or may see something entirely different in the movie, but the above is my opinion of what is on the screen.Jennifer Lawrence has the ignominious luck of having been in two back-to -back films that have elicited or are eliciting polarizing reactions from audiences to the choices her characters make and the fundamental premise of each story. In Passengers her character undergoes a journey that had some members of the audience react negatively to the choice she makes at the end and to the choice the male character makes to initiate the story. At least to that movie's credit, the story presents elements that can be used to justify her character arc, even if there can be disagreement about whether you found it satisfying or not. With Mother, alas in my opinion, there is nothing. Nada. Instead, the director has the temerity to imply an inevitability to the character's destiny or fate, intimating that there is a repetitive replicating cycle of a life as a victim. Some fans have applauded the director for being outrageous and audacious and being gobsmacked by the in-your-face assault of the story elements. Others have mentioned that the film has religious motifs and allegorical elements. Really? I don't get that at all. Is there a single redemptive aspect to this film's story? I did not see one. By the way I don't think the film's story elements and its treatment of the lead female character can be easily forgiven because these should be viewed as merely being simple \"horror\" tropes. The slasher movies make no bones about the roles played by female victims in the service of the story--some of them revel, revealingly, as torture porn and should be and are dismissed easily as inconsequential in the larger scheme of things as cartoons; but there has also been a slow boil reaction to these films warning us of their potential to desensitize the audience to female abuse and gender stereotyping. In these times when debate rages over the depiction of females in Game of Thrones and lack of female representation behind the cameras and in positions of power in the film world and in the world at large comes this film that depicts the female spirit in the most derisive manner possible. Is this because the movie makers are gambling that the audiences are in fact desensitized and will flock to the film and endure near 120 minutes of a character's disintegration on screen as entertainment? As a certain President might tweet, \"Sad!\"In conclusion, this film is a prime example of director as auteur. Every line of dialogue and every camera move and element of story should be owned by the director. I affirm the auteur's right to tell a story. I saw and heard his story. I simply did not like any of what I heard or saw.",
    "rating": "2"
  },
  {
    "title": "Painful",
    "content": "This was the absolute worst movie we've seen in years!!! It was painfully slow and just as frustrating to watch such unbelievable characters. We were sorry that we didn't walk out in the first 30 minutes. At least then we could have got a refund! But NO....We waited and waited for something to happen and when it finally came together in the very end it just confirmed our original thoughts that it was a piece of CRAP! I totally agree with the person who said it was 2 hours they could never get back. The cast drew us to this but in the future we'll look at audience reviews first and to heck with what the advertisers are saying.",
    "rating": "1"
  },
  {
    "title": "waste of time",
    "content": "I went to the movies recently with three other people with tickets we purchased at an attractively discounted price. Which movie? Upon reading reviews we settled on \"Mother\". Just a nudge beyond 2 hours long, and one of the greatest waste of 2 hours for a long time.What on earth is this about? I hated it, as did my fellow movie goers. And then, in that post movie discussion room - the men's' toilet - all were scoffing at what they had just watched. So, the next day, onto google I went and read the reviews again, and found a website that explained it all.So it's an allegory to certain events, set to a modern semi-horror movie. OK, great idea, but in my opinion, surely there are better ways to make allegories. Hopeless if the allegories are so tucked away that I have to research it online to make sense of it. OK, so now it does, and I look back at so many scenes and i find myself thinking, \"oh OK, so that's what that was about\". And I have found myself saying that so many times about so many scenes.But in the end, as a movie, it seemed so incredibly disjointed and devoid of understanding. To watch the movie as a standalone story it failed. Sure, make your allegories, but weave them into a movie so that the movie flows, is enjoyable, and you don't have to research to find out what the point of it is!! In my opinion, it failed miserably as a movie for the movie goer who simply wants to watch a movie to escape life for two or so hours. Forget it if you want watch a movie that has another take on good-beats-bad, love-conquers-all, or an exploration of human relationships in all their forms - failed, successful, homosexual, marriage, parenthood, etc, etc. in whatever movie genre - science fiction, romance, horror, crime etc.Reading the 'explanation', sure, it makes a bit more sense, but if one wasn't versed in the meaning before the movie, it was simply a bundle of scenes put together and you would come out thinking what everyone else did - what was that about? None of the reviews I read before watching it would reveal much about the plot out of respect of spoiling it for some people, so, out of respect, neither shall I. But, I will say, that had I read the plot and the explanation I would have been a lot less scathing of it. So in my opinion, read the plot. The movie will make a lot more sense when you watch it. I can't see how reading the plot and allegories beforehand can possibly spoil this abomination of a movie.The allegories were too camouflaged. If one has to resort to the web to work out what the hell I just watched, then the movie fails in my opinion. And just how many people will bother to go online to gain an understanding of what they just saw? As for the rave reviews, honestly I wonder if people get so blown away by movies just because they are off center and mystical and contorted in what they are trying to say. Production wise , and acting wise, I have no complaints there.For me, the only scenes worth watching were the shots of Jennifer Lawrence's adorable seemingly perpetual teenage good looks and the one frontal shot of her wearing a see-through nightshirt. Very tasteful and teasingly hinting at a lovely female form.Apart from that, I hated \"Mother\". I would never watch it again. Understanding it or not. My three other friends were just as scathing, as were the few people I had the pleasure of briefly discussing the movie with over a few moments of liberation post movie. In summary, the worst movie I've seen in years. And pardon some of the puns in my review. That might make a bit more sense after you've seen the movie.",
    "rating": "1"
  },
  {
    "title": "Set your expectations lower...no even lower.",
    "content": "I went into mother with high expectations. Its a star studded cast with an incredible director and creative team behind it, but this show honestly sucked. It started out as a snooze fest. The cinematography was excellent and there were some creative shots, but for the most part it was pretty boring. And then came the house guests. Oh boy. The whole story line was just obnoxious. I hated every character. You have Michelle Phiffer who is a horrible human, Ed Harris who is off his rocker, and Jennifer Lawrence who plays the submissive housewife who takes all of their crap. She doesn't stand up for herself or to her husband and it drove me NUTS. I wanted to put my arms through the screen and shake Jennifer Lawrence the whole time and tell her to stand up for herself! After the house guests leave the story became absolutely crazy. Not crazy in a good way. Crazy in a \"why am I sitting here watching this film\" way. While I understood the film in the end, there was absolutely nothing redeeming or entertaining about this story line to me. About midway through the movie I turned to my friend and said \"maybe we should just leave\", but we decided to stay and I truly regret that decision. The last half of the movie was utter chaos with no light at the end of the tunnel. I felt this entire movie had no sense of direction. The ending was artsy, but totally bazaar and there was truly not a single moment of this film that I enjoyed. I didn't give it a 1/10 because of the cinematography and creativity, but if it weren't for those things this would have gotten a 1. I HATED it. Save your money on this chaotic \"psychological thriller\" and go see IT instead. I promise you aren't missing anything with this mother of a dozy.",
    "rating": "1"
  },
  {
    "title": "dear god what a mish mash of trash",
    "content": "first off let me start by saying I was looking forward to watching this film after all the mysterious hype. the acting is forced and without sense of direction, the structure of the film is totally confusing and at times annoyingly so. the story line is so pretentious it is bordering on offensive. not to give anything away the basic story is of a couple who have uninvited guests of varying annoyance ,well that's the films story in a nut shell. save your money and read a book from the bible its a lot less confusing and annoying total and utter waste of talent because these are talented actors and deserve better and so do we.",
    "rating": "1"
  },
  {
    "title": "Abhorrently bad",
    "content": "Spoiler/PSA ahead (If only someone had \"spoiled\" the film for me!)This film is abhorrently bad. I've seen bad films before, but never have I left a theater feeling disgusted, angry, nauseous, and even betrayed. They were pretty tight-lipped about what this film is actually about, and now I see why. It wasn't to guard a clever plot twist (there isn't one), it was because if the audience knew the level of gratuitous horror and violence they were about to witness most would never sign on. I genuinely feel deceived. I would have never gone to see this film had I known. I would've preferred a Saw movie - at least both the audience and the director are on the same page about what is being produced and consumed.This film ruined more than just my Saturday night. It ruined some of my favorite actors for me as well. Lawrence, Bardem, Pfieffer, Harris (even Kristin Wiig?!) - I actually judge them for their participation in this film. They gave good performances which were rendered completely irrelevant by this grotesque, stupid, and increasingly desperate film. It also ruined other Aronofsky films for me. I loved The Wrestler. It was soul crushingly sad, but it was beautiful. Mother! is so distastefully bad that it leaves me questioning the validity of Aronofsky's other successes. Spoiler alert! If your idea of a good time is watching a newborn infant smashed, ripped apart, and eaten in front of his mother in graphic detail, then by all means - head to the theaters! To say that this scene crossed a line for me is a gross understatement. As a mother (or perhaps just a human?) I felt physically ill watching this wildly unnecessary scene (I'm sure the director will disagree with me about its \"necessity\" but he's kidding himself). I can't imagine the lies everyone involved had to tell themselves to justify that scene. It wasn't \"profound\" it wasn't \"art\", it was simply desperate and basic and disgusting and in no way justifiable. Even without that scene the movie is completely irredeemable. It is (hopefully) the worst movie I will ever see.",
    "rating": "1"
  },
  {
    "title": "What a steaming pile of \" Rosemarie's baby \" ripoff poo !!!!!",
    "content": "Let's begin w Lawrence's absolutely lame and ridiculous performance . The only thing She's good for is making those unrealistic surprised and confused faces at the most inappropriate moments. There are a ton of figure it out yourself moments that never come to fruition. Why include them ? What was the point of showing these instances without pushing thru ? There's so much going that none of it ever connects. Why was ed Harris even in this movie ?? His part made absolutely no sense whatsoever. Total failure on the directors part. Completely disjointed theme w zero delivery. Total flop. Director made u uncomfortable in his other epic films. What happened here??????",
    "rating": "1"
  },
  {
    "title": "Piece of Crap!",
    "content": "I demanded my money back and wouldn't leave the theatre until I got it back. DO NOT WASTE YOUR TIME ON THIS MOVIE! This is what I call an \"Emperor's New Clothes,\" movie. People will be afraid that this was something significant and deeply intelligent and they didn't get it so they will say they thought it was brilliant, when in fact it took a child to say, \"Hey! the King is naked!\" and finally the people in the crowd said, \"Yes!\" and \"He's right!\" And that is what this movie is. Naked. Nothing. Lots of special effects and images and stuff to back time-misplaced Beatniks say, \"Oh! But this is a dazzling expose and analogy of the nature of the relationship between humankind of God. In fact it is nothing. It is absolutely NOTHING. Anyone could have strung a lot of dialogue together and told us it means something. In fact at first I thought it was like that episode of Monty Python where the guest keep showing up and won't leave. As the credits rolled I accidentally cried out, \"What a piece of crap,\" and a bunch and people called at comments like, \"Yes!\" and \"He's right!\" The Emperor is naked.This movie made me feel pummeled and intellectually raped. I would have rather watched preview for two hours than watch this movie.YOU HAVE BEEN WARNED!",
    "rating": "1"
  },
  {
    "title": "Horrendous and not worth the time",
    "content": "Long Post; Don't read it all: THIS MOVIE IS HORRIBLE AND WILL BE THE WORST MOVIE OF THE CENTURY.ALRIGHT LADIES AND GENTLE PEOPLE, my thoughts on the movie I just saw \"Mother!\"...warning, and I mean this with the highest level of forewarning as I can possibly give you. This post is very much a possible trigger for some people, so please if you are not a gore or fear or anything like that kind of person, please skip this post and go watch cute videos on YouTube. Alright...you have been warned.Mother! Summary: A Psychological horror film made amazing.............ly awful. Its absolute trash and (Insert Rick Sanchez's voice) and I can prove it mathematically. Things I would rather watch:2 Hours of The Big Bang TheorySuicide SquadAnything with Ben AfleckStep BrothersLITERALLY ANYTHING OTHER THAN THIS MOVIEThings that made this movie awful:Well, for one, I DID NOT want to see an infant child (literally born 2 minutes ago) get it's spine snapped and then viciously torn apart and eaten by a sobbing/angry mobThis movie gave me a migraine just trying to figure out what was going onIt literally explains nothing and gives you a constant sense of confusion that never leavesIf you hate loud noises (I.e loud ringing, screaming, scratching) to the point you feel like your ears are going to bleed, then you'll 100000% hate this movieIt does not scare you, it does not give you a feeling of dread. If anything at all, you'll just want to throw up in a box and mail it to the director.",
    "rating": "1"
  },
  {
    "title": "The worst movie I've seen in decades.",
    "content": "Filled with half baked Biblical references, this is a boring excuse for yet another movie showcasing violence against women. Campy 16mm filming and characters without names don't help. There were no redeeming characters, no dialogue. It's easy to accept that it was written in 5 days. Groundhog day for the underworld.",
    "rating": "1"
  },
  {
    "title": "Like a  very very very bad Rosemary's Baby.",
    "content": "I wanted my money back. J-La should have picked something else. They never seem to connect with the Audience. Javier is so distance from her and it seems like she would say hey and slap him and and say hey dumb ass. Also why did she not call 911 on the first day or when the man is attacked in the house. Bizarre does not describe it. Psycho trip. No thank you.",
    "rating": "1"
  },
  {
    "title": "Total Waste of Time",
    "content": "At first I thought there might be plot holes, but then realized there was no plot. Lawrence's performance borders on idiotic. The screen play reeks and the director must've been high on meth. Seriously folks, this movie is a insult to human nature and intelligence. I seriously doubt an Auschwitz labor camp guard would enjoy it. Don't waste your time or money unless seeing a baby's neck snapped before it's eaten by hipsters is on your bucket list. Surveillance cameras in an insane asylum would've been more entertaining.",
    "rating": "1"
  },
  {
    "title": "If there is a movie theater in hell, this is playing there",
    "content": "I have been going to the movies for 45 years. This is, hands down, the worst movie I have ever seen. I mean, I hated this movie. Plan 9 From Outer Space and The Room were at least entertaining. This is like being locked in a cell with a stoned college student who can't shut up and thinks that every opinion they have, is the final word on a subject for 2 hours. Jennifer Lawrence should stick to roles that require her to paint herself blue or shoot arrows. Darren Aronofsky wants to be Luis Buñuel but he's closer to Uwe Boll. He cites The Exterminating Angel as the inspiration for Mother! I agree, in the sense that I did feel like one of the dinner guests who can't leave in Buñuel's classic during the course of watching Mother after paying 13 bucks to see this pretentious, heavy handed waste of time. Do yourself a favor, don't go see this movie, you won't get the 2 hours of your life back if you do. When it shows up on The Movie Channel playing at 3 in the morning in a couple of months, don't even set your DVR to record it. There are infomercials about gardening tools on at the same time, that are much more entertaining to watch that this.",
    "rating": "1"
  },
  {
    "title": "Film sold on Lies and Star power",
    "content": "I have made this account specifically to warn people about this film it's so bad. This film was painful too watch. During the film I saw several people walk out they couldn't bare to watch this trash film any longer, do not watch this crap! Don't hand any money to the people who made this the film! It's not a horror film the trailers were completely misleading it's all a bunch of metaphorically crap. no one acts like a human would or should in the situations shown in the movie probably because its meant to be a metaphor but it just made me wish the film would end.",
    "rating": "1"
  },
  {
    "title": "Forget the \"critics\", just go watch this amazing movie!",
    "content": "This is NOT the story of a writer and his wife. This is a story about an entire religion and its believers! Complete with a \"God\" that must make \"forgiveness\" the base of everything, no matter how much it upsets the real Goddess: his wife, mother Earth! Yes, it's an allegory. So what? This one analyzes and dissects the false goodness on which this entire religion is based. Including the Son of God who ends up killed by his admirers! And what was that about the communion every Sunday where the blood and body of Christ are eaten by the believers? Yes, the \"God's\" son also ends up eaten! No, it's not shocking! The religion it portrays is what is shocking! JLaw performs a festival of good acting, so do Michelle Pfeiffer and Javier Bardem. Don't lose this one!",
    "rating": "10"
  },
  {
    "title": "Worst movie I have EVER seen!",
    "content": "If you love chaotic, nonsensical, pointless, confusing movies, this is right up your alley. By far, this is the worst movie I have ever seen. I can deal with boring movies, or movies that just aren't my cup of tea. This was pure torture to sit through. I am shocked, as I am a fan of most of the actors (when they are in other movies,that is). Don't waste your money or time.",
    "rating": "1"
  },
  {
    "title": "More Misogynistic Garbage",
    "content": "This film is hateful misogyny pretending to be metaphoric.Yes I walked out. It's disgustingly cruel and gruesome. Do we really have to witness how low humanity can go? According to Aronofsky sick view of the world, we do.Make no mistake about it, this man is a socio-path pretending to be a film-maker. I've seen black swan, I've seen requiem. Mother is the final nail in the coffin for me. I for one will never see another Aronofsky film. Don't let other reviewers or critics fool you. It's not about pushing boundaries. This is about assaulting viewers with unimaginable repulsion.Calling it biblical is a stretch. But if fools want to take that stance, remember this passage from Jeremiah 19:5-They have built the high places to burn their children in the fire as offerings--something I did not command or mention, nor did it enter my mind.No dear people, no one asked for this. Healthy minds do not entertain such dark thoughts.But the hateful mind of Aronofsky imposes his dark and disturbing view of reality as an offering to other sick minds. Minds that belong locked up in a padded room with large doses of lithium.",
    "rating": "1"
  },
  {
    "title": "Pretentious twaddle",
    "content": "Aronofsky has said that he wrote this film very quickly. It shows. The intriguing set-up: a blocked writer and his young wife are trying to create an artistic oasis for themselves, but are visited by random strangers, falls to pieces very quickly. Jennifer Lawrence is compelling, as always. In fact, each of the four main actors are solid and much of the movie is beautifully filmed,particularly the dizzying use of hand-held or close-up tracking cams. But the writing and plot are absolute garbage. Shockingly bad movie that will appeal to pretenders.",
    "rating": "1"
  },
  {
    "title": "The Worst Movie Ever Made",
    "content": "If I could give this dreck minus a trillion out of ten, I would. It is self-indulgent, pretentious filth! There was no story and no scares. It is long boring and weird with a baby ripped to shreds and eaten and a heart ripped out of a charred woman's body. It tops the list of my worst movies ever, which is saying a lot since I have seen thousands of them. Do not waste your time and money! Avoid this like a heart attack, it's a cinematic misogynistic hate-crime and an ugly assault on our senses. I wish I could unsee this and wash the memory of this sick, ugly film from my mind.",
    "rating": "1"
  },
  {
    "title": "mother of all bullshits",
    "content": "Mother of all bullshits Ingredients: a pinch of Shining over a bowl of Rosemery's Baby marinated by a touch of The Others. To finish, plagiarise a bit of In the Country of Last Things (Paul Auster) and don't forget the Zombies! Stir your ingredients violently with a processor adding a load of noise during the process. And... Voila! Your bullshit is ready. Bon appetite!",
    "rating": "5"
  },
  {
    "title": "Oh, no, where has my creativity gone?",
    "content": "A couple's relationship is tested when uninvited guests arrive at their home, disrupting their tranquil existence. This is a pretentious, self-indulgent waste of time. A man and a woman alone in a farm house. Two hours of a self obsessed poet struggling to regain his creativity and a young woman who loves him. I loved Aronofsky's Requiem, but after that he seems to have faltered, especially with this effort. I'm just not buying into the \"creative\" hype. By the end of the 2 hours my wife and I could not wait to leave, eye candy notwithstanding. Save your money. It's 2 hours I will never get back.",
    "rating": "1"
  },
  {
    "title": ";Not worth it.",
    "content": "I've never watched a movie with Jennifer Lawrence aside from Hunger Games. She's just never done anything since then that was my cup of tea. I am a long time fan of Michelle's, though, and I love scary movies, so I had to see this. It disappointed me. I thought the first half was boring for the most part, and the second half was better, but not enough so to make up for the first part. Wouldn't recommend it. Wish I would have went to see IT instead.",
    "rating": "1"
  },
  {
    "title": "It's a giant steaming fly covered pile of poop.",
    "content": "(A SPOILER MAY BE IN THIS REVIEW, BUT IT'S HARD TO SPOIL CRAP LIKE THIS) I saw this thing Friday night. Since it had great opening reviews I decided to go. I love the director and stars. Requiem for a Dream is 1 of my favorites. But this is no DREAM, it's a nightmare. It's a giant steaming fly covered pile of poop. I'm not sure where the director was going with this but he ended up directly in hell.(spoiler) Sort of a cross between Rosemary's Baby and Ground Hog Day. It's unimaginably depressing, dour, sick, nauseating and self indulgent. No wonder Jennifer Lawrence has had nothing to say about it on the talk shows. THERE'S NOTHING POSITIVE TO SAY!! Oh wait, 1 thing, Michelle Pfeiffer is 1 hot NASTY old broad. She is the only redeeming quality in this movie. Hopefully they bury this thing in a very deep hole. One last note... I always hear black people talk about horror films and say: \"If that was a black person they would get the hell out of there!!!\" Well let me just say to YOU, JENNIFER LAWRENCE: \"WHY DIDN'T YOU GET THE HELL OUT OF THERE?\"",
    "rating": "1"
  },
  {
    "title": "What a worthless film",
    "content": "It would appear watching this film is like having a splinter shoved into your eye ball and you have to keep it there till the film is over. Jennifer Lawrence clearly did better with her \"leaked\" photos then acting in this film. If they had a better actress and a survival plot line, then this film would have hope. You can clearly tell this film was produced just to make in some extra cash from the film industry.Slap in some adobe after affects and some cheap B rated sound effects and you have rosemary's baby - the B rated featured film version.Plot ending is just as pathetic as the start of the film, you do not even need to guess what happens.Same your money, or see any other film.",
    "rating": "1"
  },
  {
    "title": "I'm at a loss to explain just how BAD this movie is...",
    "content": "I've been perplexed by the trailers and the talk so it was a given that I had to go see this \"psychological thriller\". After watching I feel that the only thing \"psychological\" about it is the utter confusion and disbelief that critics are rating it as high as they have. The movie makes absolutely no sense and it's simply a complete ripoff of Rosemary's Baby...that's the best explanation for it and I know I'm not the only one. It was obviously written in the six days that it was claimed by Aronofsky, as it seems most of his scripts are written without the slightest idea ORIGINALITY. It's a half baked script turned into an even less baked movie.... Don't waste your time or money.",
    "rating": "1"
  },
  {
    "title": "No Question, This Movie Was a MOTHER!",
    "content": "This film was beyond horrible. I don't know what Aronofsky is trying to accomplish, but no wonder his name is attached to projects, then removed. This is one of the oddest, most absurd wastes of time I have ever seen. By the third act, everybody in the theater was talking to each other about how bad this movie was. The only reason I stuck around, was to vent with other movie goers about how terrible this abortion of a film was.You have been warned, this isn't artistic, horrific, or dramatic. Its two hours of organized confusion that will most likely leave you upset that you threw your hard earned money after it.This film was garbage, garbage, garbage!",
    "rating": "1"
  },
  {
    "title": "I never ever hated a movie this much in my life. Gross. Wish I hadn't seen it.",
    "content": "**** apologies in advance for the language*** I never ever hated a movie and wished I hadn't watched it this much in my whole life. I am a huge fan of horrors. Violence or gore in movies don't affect me at all, but I actually feel sick and gross after watching it. It started out as an unsettling thriller and I was quite enjoying it, until things got so f*cked up that many people left and I, for the first time in my life, thought about leaving the cinema too. I wish I did. Honestly, it was the most vile, gross, f*cked up thing I have ever seen. Compared to this, \"Inside\", \"Martyrs\" and \"Human Centipede\" are PG. Pure and gratuitous pornography. And there was absolutely ZERO pay-off, just pretentious b*llshit masqueraded as \"metaphors\" and \"art\". What kind of sick f*ck would come up with this \"concept\" and decides it's OK to show it? I am never EVER going to see any of his movies again.",
    "rating": "1"
  },
  {
    "title": "On my growing list of the worst movie I've seen.",
    "content": "I get a lot of free movie theater tickets so I see a lot of movies. So I thought why not \"go with the flow\" and see the movie \"Mother!\" The theater was half filled so it was an OK turn out. However I saw over 50 people leave around 30 min in, mumbling and grumbling. So at the end of the film when filing out I heard a bunch of criticisms like \" what a piece of cr**p\" and \"can i get a refund for this x-movie\" and \"false advertisement\".I completely agree with these assessments and viewpoints. Here is why: *False advertisement: movie is not as it was advertised.*script: written by a dialectic child, filled with cliche's, fake stuff up the wazoo and is even worse than the worst movie I have ever seen ( for the record that was Himalaya where the nearly 3 hours movie plot is about getting Yaks over the Himalaya's)*Directing: Honestly even lower than an amateur and novice combined. The eunuch that directed this \"piece\" is less competent than the most incompetent Youtuber.*Camera position: UTTERLY FUBAR.. but then that is what you get when you have 6 year old ( or someone with a mental capacity of a 6 year old) directing a \"movie\" where your girlfriend plays the main role.*Acting: From bad to abysmally horrible. The often blank expressions and the hellishly faux script is part of the problem but Jennifer L looked like she was on something when they did this ... erm.. \"movie\". Seriously lady: you need to get that checked out, it is like some bad tick or something.Publicity debacle a la Irma: this is where Jennifer L is saying that \"Gaia\"/\"mother Earth\" is punishing the US for voting Trump and that \"she was OK with hurricanes destroying people's houses and belongings\". Not a smart move Jennifer, not a good move. What you SHOULD HAVE DONE to promote your movie was to go down to Florida and HELP PEOPLE. Oh well the mask is now literately on the ground so the people can see who you really are.Final thoughts and conclusion: AVOID AT ALL COST!!! This is currently one of my worst movie experiences ever.",
    "rating": "1"
  },
  {
    "title": "Worst Movie I Have Ever Seen",
    "content": "Wow, so...yeah...terrible, terrible movie. I have never written a review on here or anywhere online before, have never even been remotely tempted to write a review online before, and yet, here I am. I just feel like it's my duty to help people from making the same mistake that I did by wasting my time and money on this film, because, I mean, on the surface it looks like it could be a good movie. The trailers depict it as a tense horror movie helmed by a capable director and starring an A-list cast. Ed Harris and Javier Bardem are two of my favorite actors and despite some of the negative press that Jennifer Lawrence generates, you have to give her credit, the girl can act. So I can see how a lot of people would be drawn to this movie like I was, but please, if you're reading this, avoid it like the plague.After looking at some other audience reviews, I see that the typical rallying call the fans of this film are clinging to is that 'if you didn't like it, you didn't get it', and to those people I say: get over yourselves. This movie is not some complicated film that is hard to decipher. It's a relatively straightforward allegory that fails amazingly on almost every level as a movie. Its neither entertaining or (with the exception of Ed Harris) well acted, and there is some truly terrible CGI present as well, as if Aronosky wanted to make sure his film was awful in every possible way. Listen, when I say this movie is BAD, I don't mean the so-bad-it's- almost-good kind of bad, I mean its the I-feel-like-I-have-been- sitting-here-for-seven-hours kind of bad. The only way I would ever watch this movie again is if I was given the Alex DeLarge treatment and strapped down with my eyelids held open. This movie contains some powerful, powerful levels of B-A-D, avoid at all costs.",
    "rating": "1"
  },
  {
    "title": "A Bad Story, Poorly Told",
    "content": "In a word: Awful. This movie was just two hours I'll never get back. Because I think all four of the main actors are highly talented, I'm left but to blame the director for this film, which seemed to be two hours of used toilet paper. It was weird that nobody had names, NOBODY. I figured, well, okay, but that sure makes it hard to grow an attachment to anyone in it. It was just weird crap of Jennifer Lawrence having weird visions or premonitions. Suddenly, Ed Harris shows up behaving more or less like a lout, although Javier Bardem warmly welcomes him. Even though there's zero cellular reception, Michelle Pfeiffer (Ed Harris' wife) shows up the next day and walks right in like she owns the place. Soon after, Harris and Pfeiffer's sons come barging in and get into a violent fight in which one is beaten to death while the other flees. Bardem traipses out, leaving Lawrence in the house all alone with a murderer in the wind, and that night the house is invaded with a dozen more people, arriving out of nowhere to share in the grief of Harris and Pfeiffer over the Cain-and-Abel moment of one son killing the other. I guess I shouldn't give much more away here. Suffice it to say this movie utterly sucks. Keep your money in your pocket.",
    "rating": "2"
  },
  {
    "title": "A Pretentious Danse Macabre",
    "content": "Mother! (2017), staring Jennifer Lawrence as the titular character and Javier Bardem as her husband, Him, is writer/director Darren Aronofsky's nihilistic allegory for Biblical creation and the rape of nature. Though marketed as a psychological thriller, Aronofsky told Vanity Fair after the Toronto International Film Festival the film is \"about how it must feel to be Mother Nature.\" It was partially inspired by Shel Silverstein's picture book The Giving Tree. No, really.The story itself isn't very interesting. A writer lives with his much younger wife in an old octagonal farm house on the prairie. Uninvited house guests interrupt their solitude. Their transgressions worsen, climaxing in a murder that leaves a permanent, bloody scar in the floor. Things settle down again after Mother becomes pregnant, but then crescendo into an orgy of violence and depravity as the writer's fans take over the house and begin worshiping him.It's difficult to say for what audience Mother! was intended. People who enjoy long, boring interludes punctuated by moments of extreme violence? It's not for the squeamish or easily triggered, but it's not a work of genius either. For my part, it was painful to see talented actors and actresses, including Ed Harris and Michelle Pfeiffer, wasted on this pretentious monstrosity.Throughout the film, and especially in the final act, Mother is marginalized, tormented, brutalized, and violated. At one point, her clothes are torn open and she is repeatedly punched in the face. Finally, her heart is torn from her burnt chest. I think it's a little bizarre that A-list actress Jennifer Lawrence, who prides herself on playing strong female leads and on being a role model for young women, would agree to star in her boyfriend's deranged snuff film.I'm not going to call her a hypocrite, but after reading her explanation in The Telegraph, all I could think was, wow, this person is really dumb. Aronofsky compounds that feeling when he explains that he wrote the script's first draft in five days, and that it stemmed from his frustration at not being able to do anything about \"living on this planet and sort of seeing what's happening around us.\" Oh brother. Lawrence and Aronofsky's combined net worth is $145 million. They're powerless to help the planet? Try planting a tree or picking up some trash on the sidewalk.The pernicious belief that the earth would be better off without human beings is fashionable among radical environmentalists, and illustrated in Mother! by Mother's constant pleading and begging Him to get rid of their annoying house guests and return to their solitude. Yet without humanity, there is no theater, no movie, no audience, and no point to be made. As Nietzsche says in his essay On Truth and Lies in a Nonmoral Sense, \"this intellect has no additional mission which would lead it beyond human life.\" I bring this up simply to illustrate that what we're seeing on screen is Darren Aronofsky's own self-defeating revulsion and disgust at humanity, not some clever point about how nature is harmonious without human beings. Aronofsky has clearly cast Javier Bardem not as God the Father but as himselfthe creator of this film and someone who harbors deep resentment toward humanity.Audiences have strongly reacted to this film. I saw one couple leave during the infanticide scene, but overall I found it incredibly boring. If I wasn't writing a review, I probably would have walked out of the theater as well. When Mother wakes up the morning after having sex and declares \"I'm pregnant,\" someone in the audience actually started laughing. I had a hard time staying awake until the end.When Alejandro Jodorowsky's Fando y Lis premiered at the 1968 Acapulco Film Festival, a riot broke out and the director's car was pelted with rocks. It was banned by the Mexican government for its sacrilegious depiction of Catholic ritual. Like Fando y Lis, Mother! also features surreal scenes, cannibalism, and a female protagonist being brutalized by a frenzied mob. Will Mother! have as much impact in today's America? Or will audiences simply react with revulsion to its grotesque Grand Guignol and miss the religious symbolism altogether? Overall, there's not much positive to be taken away from this film, although I did appreciate the setting. Everything had a raw, earthy look and feel. Real texture. I love when the characters literally dig into it and organic wounds open up as though the house itself is alive. Once again, style trumps substance in 2017.",
    "rating": "4"
  },
  {
    "title": "Utter Disappointment. Worst movie I've seen in...forever!",
    "content": "Honestly, the trailer left me wondering what this movie was about. Because of that, I was even more intrigued to go see it. Now that I've seen it, not only am I even more confused, I'm irritated as all get out that I wasted $75 to take my family of 4 to watch 2 hours of absolute garbage! My husband actually left early and waited for us in the car! It was that bad! And it's no joke that when we all got back to the car, none of us could even explain what we'd just watched or what had happened! The movie was so dumb! I kept waiting for some twist to bring it all home like The Black Swan did. Never happened! Jennifer Lawrence walked around (with no name) pregnant and barefoot throughout the whole movie looking doe-eyed and bewildered. Michelle Pfeifer was annoyingly all pucker-lipped and drunk. One minute the scene is calm and the next your watching a war-zone! Literally! It's as stupid as it sounds! People in audience we laughing and kept saying \"is this over yet?\" The mutters of embarrassment and disgust was painfully obvious walking out of the theater! Hands down the worst movie , and the biggest disappointment in a film, I've ever seen! I'm not easily offended but it was an insult to my intelligence. Shame on Hollywood.",
    "rating": "1"
  },
  {
    "title": "A Future Camp Classic",
    "content": "\"Mother!\" (why the exclamation point???) is an example of what happens when an artist's impulses are left unchecked. Lawrence's involvement is probably what made the studio execs leave him alone because they figured it might still make money. This film is just artistic hogwash. I've enjoyed all of Darren Aronofsky's films except for this thing. The last 30 minutes are so incoherent that it's not even offensive. It's just stupid. The only way to even get a bit of enjoyment from it is to view it as camp. The house's explosion near the end is what made realize that camp is exactly what this film is and will eventually become. It's a major, major misstep for Jennifer Lawrence and Aronofsky.",
    "rating": "1"
  },
  {
    "title": "Worst movie ever - so disappointed - a must avoid",
    "content": "First off, I'm a big Aronofsky fan. The wrestler, black swan, requiem. Loved them. And offbeat is my thing. Eraserhead, Blue Velvet and Harold and Maude are among my faves. But I'm at a loss to figure this movie out.The star filled cast seems lost in the sauce. If the goal first to bore then make us Ill, it was achieved. The allegory and metaphors were transparent and lame. Gawd I wish I could unsee this movie and get my 10 bucks back. And someone here should audit the 6.8 rating. I can't believe it's legit.",
    "rating": "1"
  },
  {
    "title": "Worst film in a long time.",
    "content": "I see a lot of movies. 6 this week alone and sadly one was Mother. I like the stars in the movie but the movie is just horrible. It makes no sense. Other reviewers have tried to read into it that it's about Mother Earth, about god and about the devil. It's really about nothing. It's just a mishmash of scenes that make no sense and gets progressively worse as it seeks some conclusion. Unless you just must see every movie out there, absolutely skip this.",
    "rating": "1"
  },
  {
    "title": "Worst Movie I Have Ever Seen",
    "content": "I had time to kill while my car was in the shop. One of my all time favorite movies is Rosemary's Baby so having heard Mother! compared to it decided to see it. There are no words to describe this nonsensical, ridiculous \"movie\". If you like to look at Jennifer Lawrence's face - 3/4 of the movie are close up shots of her face and it literally fills the entire screen. I can 100% absolutely guarantee you will hate this movie.",
    "rating": "1"
  },
  {
    "title": "Suicide Soda of Misogynistic Metaphor",
    "content": "I read some of what Aronofsky was aiming at in this creation, and I would like to summarize this in his favorite language to bastardize... Metaphor: Darren went to the great soda fountain of metaphor and Biblical allegory and he made what some call a \"Suicide\", just a shot of every possible sugary beverage possible, and some cheap booze in a similar varietal. Likely an 8-ball of cocaine to make it seem like a good idea. Then he drank it down quickly (\"I wrote the script in just 5 days\" Darren splendors - Oh Really? And I presume you're beyond editorial support at this point in your artistic pinnacle?). He then took his current real-life girlfriend, Jennifer Lawrence, (Jen. Run. You're better than this.) and he strapped some electrodes to her for shock value, and he peed all over her and filmed it using only three shots for some film-school-senior-project level fancy: close up, from behind, and point of view. Then he praised himself for making a film that is 'really about how we are treating mother earth'. Yeah. He did that. And he thinks he's smarter than you. I am not sure if there is enough cocaine in Hollywood to explain the amount of ego masturbation that this film portrays. The whole not-too-subtle story of Artist as God who abuses his muse and is obsessed with praise is heavy handed. You're not a God, Darren. Your art is pretentious tripe, much like the intestines of the baby on the sacrificial table. The real kick in the labia is the utter misogyny of the film, produced by a group of ONLY males (6 producers, editor, cinematographer, etc, plus the Douche). So, a penis parade made a nightmarish film about motherhood and society's dismissal of the feminine and weren't smart enough to see the irony in not having a single woman above-the-line on the production? You fellas are just a bushel of genius right there.I feel like I need to wash Aronofsky's spooge from my eyes. I am not going to see another one of his film's until I get at least a dozen trustworthy opinions first, and more than half of them need to come from females.",
    "rating": "1"
  },
  {
    "title": "Waste of time and money",
    "content": "Went in on this one cold, as in I didn't know what it was about, except for seeing a brief trailer some time back.This was some weird and dumb metaphoric religious mumbo jumbo. I think it was trying to convey something about the self-destructive nature of human existence... or something... I heard an argument that this is a feminist piece, I don't know, maybe. I really don't know what to make of it actually. It only seemed to get more people in the audience making fun of it than taking it seriously. In fact, the more disturbing it tried to be, the more people seemed to laugh. Hollywood has gone insane with nonsense film-writing.The trailer for Downsizing got the best reaction from the audience the whole time.Don't give these people your money.",
    "rating": "1"
  },
  {
    "title": "Your Personal Rorschach Test",
    "content": "This is where all art is today. To make art today, you assemble the most disgusting elements you can dig up, mash them together and proudly display in all pretension for delusional art critics to fawn over. Here we have an odd collaboration of the lead actress and her current boyfriend as the director which gives us wonderful shots such as close-ups of her nose and the back of her head. From time to time she breaks from her default mode of being the new Great Stone Face to come up with contextually improper muggings for the camera. The 'art' here is twofold. First, to see if you can endure the boredom and second if you can stomach the non-boring parts. Maybe the idea was to show the world that if it's not bored, it's revolted. There is no middle ground. There is no sense which no doubt some critics will laud as a reflection of life where there too, there is supposedly no meaning to anything including our pathetic sterile lives. Miss this if you can.",
    "rating": "1"
  },
  {
    "title": "Boy, where to start!",
    "content": "Aronofsky's films somehow get sterling reviews but bore me to tears...The Wrestler (yawn), Black Swan (yuck) and Noah (total mess)! Add this to the list. Not once did I feel any sense of suspense or dread. Javier Bardem seems to be sleepwalking through the picture,(he showed more emotion as the maniac in no Country For Old Men) and there is such a total lack of chemistry between him and Jennifer Lawrence that you can't buy them as a couple in the first place. The rest plays out like some Felini reject. Avoid this \"film\" at all costs!",
    "rating": "1"
  },
  {
    "title": "Worst movie I watched in cinema",
    "content": "I read a previous comment stating that you have to be a genius to appreciate that film. I m quite of wondering what are the good things of the film that only a genius mind would appreciate. A Lawrence acting poorly, a plot so boring in the beginning and so annoying in the end. The only thing that makes me feel stupid is that I affluent 10e for this crap and two hours of my life",
    "rating": "1"
  },
  {
    "title": "After Earth part II",
    "content": "Hmmm thinks Darren Aronofsky, what do I do to promote my girlfriend Jennifer Lawrence since she is not getting big roles anymore??? Eureka! I just throw together some vague script (after snorting a few lines of coke) and have Jennifer stick her face in the camera for half a movie (take that literally). To cover for being lazy I just throw in all the standard dogma's of modern day liberalism about Christianity that were left on the cutting from Noah and about us destroying the earth and I have some people say that if you cannot understand all this tripe you are stupid. Also we try to lure people in by saying it's horror, thriller and whatever. Then we circle-jerk and to help save the earth we lavish ourselves in all the luxury items in our big mansions. And we end up with an art-school film costing 40 mil... Like After Earth this is just a shameless promotion like Will Smith tried to pull off, with the same result and they also pretended that movie was about us destroying the earth come to think of it. So in effect: After Earth part II.",
    "rating": "1"
  },
  {
    "title": "Disturbing on so many levels",
    "content": "This movie is truly one of the worst that I have ever seen. I'm not really sure what the point was - most movies have an objective - to frighten, to thrill, to amuse; this one doesn't seem to know what it is supposed to do; It's not a horror movie, nor is it a thriller. There is no connection between the characters - even with \"Mother\" and her husband. The dialogue between them was almost non- existent and there was absolutely no chemistry among any of the characters.There is a lot of confusion about what is actually happening with all the various characters who show up until probably about the final 15 minutes; at that point, it went from the worst movie ever to a trip to Hell; this movie really crossed the line of decency as there are some things that just should never be in a movie. I left the movie literally feeling sick to my stomach at the 'turning point.'",
    "rating": "1"
  },
  {
    "title": "To each his own",
    "content": "I get why some people loved this movie. I totally get it. But personally I am really, really upset I spent 2 hours of my life watching this film. This film is purposefully obnoxious, smug and manipulative. It spends 70 or 75 minutes dawdling around a house where uninvited house guests keep coming over and weird things keeps happening; then J Law gets pregnant and all hell breaks loose and a baby is murdered and eaten and the house burns down and it turns out Javier Bardem is God who keeps trying to get things right and can't seem to make it work. Basically this is the cinematic version of an overwrought undergraduate thesis paper on the evils of religion. I totally get the point that Aronofsky is making and I appreciate the fact that Paramount Pictures was willing to put up $30 million to make something wildly experimental and violently off-putting. But I still hated the experience of watching this movie. That reaction is not going to change just because it has some important lessons to teach.",
    "rating": "2"
  },
  {
    "title": "Huh..?  What a waste of two hours.  Spoiler alert.",
    "content": "Where to begin? The actors in this film are all quite accomplished. The Director/Writer, Arnofsky, has multiple large and unusual films to his credit, if not the critical acclaim he undoubtedly thinks is his due. The film tries to be art, but ends up being only artifice. It's full of allegory, and symbolism, but not for dramatic or literary effect. The viewer is beaten over the head with the allegorical inferences until they lie in a bloody pool, like so many of the characters. A better writer might have taken a few weeks to smooth out the more ridiculous moments in the script, or heighten the few suspenseful ones. A better director might have used the house to better elucidate the plodding plot. The man, Javier Bardham, cleverly named \"Man\" is a poet/writer in an old Victorian house damaged in a fire. He has some sort of writer's block. His wife, Jennifer Lawrence, named \"Mother\" is doing all the work to repair the house. This is where the film departs from sanity. Two additional characters enter this home, unannounced and unwelcome by \"Mother\", Ed Harris and Michelle Pfeiffer. Ed is dying of cancer and is a fan of Javier's poetry. Javier's character welcomes them into his home, for \"as long as they like\" without even consulting his wife. It was at this point I decided that the film was set in some alternate universe where common decency and compassion are unknown. Shortly after that two brothers arrive, the children of Harris and Pfeiffer, and begin to fight over a will, until one finally kills the other in the house. The dying brother is carried out of the house by Bardham's character, supposedly to a nearby hospital. Apparently they have no ambulances in this alternate universe. While Bardham's character is gone tending to the fallen brother, the other brother is still gliding around the house, until finally Jennifer Lawrence, a bit of a neat freak, begins to clean up the blood. Apparently, in this alternate universe there are no crime scene investigators, or detectives, or police. The blood has created a hole in the flooring that drips into the basement, making one wonder if perhaps the Harris family doesn't have something else in common with the Aliens, of the 1979 Ridley Scott film, whose blood is molecular acid, other than their utter lack of empathy. Yes, I know, this is art. It's all symbolic. The film continues for another hour full of blood, murder, and cannibalism, but that's art, right? No, it's not. It's stupid, and voyeuristic, and humorless. Some writers will undoubtedly write that they found laughs in this film, well if they did then they need therapy.",
    "rating": "1"
  },
  {
    "title": "Worst. Movie. Ever.",
    "content": "I'm not kidding, this is simply the worst film I've ever seen. I won't even bother with plot summaries and analysis of the plot or actors - it's not worth it. This was a complete waste of time and money. And every time I see a commercial for it about the \"rave reviews\" I just get irritated all over again. Don't see it. Just don't.",
    "rating": "1"
  },
  {
    "title": "Don't watch this.",
    "content": "I'm beyond disgusted with this movie. You have to be extremely disturbed to enjoy this. There are several GORY and unthinkable scenes in this movie. I don't know how anyone could even come up with something so terrible. Other than the obvious disgusting properties, I don't understand the point of it. It was very hard to follow and there wasn't a clear plot line. There are a lot of holes and questions that needed to be answered.",
    "rating": "1"
  },
  {
    "title": "Jennifer Lawrence's acting is AWFUL",
    "content": "Wow, what a sad disappointment. It is clear that Jennifer Lawrence acting style has become that of a spoiled princess. Clearly Shannen Doherty would have done a better job in this film.The production crew seems to have tried their best, but you just cannot make a great film with terrible actors.It is very sad that a great idea turned into more like a south park episode.See another film, this one is not worth the time.",
    "rating": "1"
  },
  {
    "title": "Jennifer Lawrence + Darren Aronofsky = Awful Film !!!",
    "content": "I'm glad I didn't have to shell out any dollars to see this film. What I saved in money, I wasted in time. I can't believe I allowed myself to watch this mess. Maybe this year, they should designate an Oscar for \"The Year's Worst Actress\". Jennifer Lawrence would definitely garner the award for that. Lawrence was an automaton throughout the entire film. She was totally unbelievable and unconvincing in her role, not to mention, just plain boring. I guess she'll get another crack at being in another of Mr. Aronofsky's movies - as long as he keeps that 'love-match' alive! Jennifer Lawrence should probably just fade away into well-deserved oblivion. I sure won't even consider seeing another Aronofsky or Lawrence film.",
    "rating": "1"
  },
  {
    "title": "Vile filth",
    "content": "Absolute TRASH. I am so angry I gave money to this movie. Complete vile nonsense. I understand the allegory and all the metaphors he was going for but he is WAY off the mark. First, Aronofsky claims to be an atheist, yet makes a movie about an unloving God...which is it? No God or an unloving one? Anyway, he uses Creation, Adam/Eve, Cain/Abel, and the sacrifice of our LORD Jesus Christ to make a political statement about global warming and the destruction of Mother Earth which then leads to her rage and retribution. God is portrayed as a TAKER. A being that creates with the sole purpose of receiving praise and worship and sucking the life out of everything without giving in return. Gross. Disgusting gore scenes added for shock value. The icing on the cake is a newborn infant sacrifice. YEP. You won't see that in the trailer. I urge you to PLEASE not support this filth with your money. I'm disgusted with everyone who had any part in the making of this movie. I will not watch anything they have been a part of ever again. GOD IS GOOD.",
    "rating": "1"
  },
  {
    "title": "Waste of money and your precious time",
    "content": "\"The Emperors New Clothes is a short tale written by Danish author Hans Christian Andersen, about two weavers who promise an emperor a new suit of clothes that they say is invisible to those who are unfit for their positions, stupid, or incompetent. When the emperor parades before his subjects in his new clothes, no one dares to say that they don't see any suit of clothes on him for fear that they will be seen as \"unfit for their positions, stupid, or incompetent\". Finally, a child cries out, \"But he isn't wearing anything at all!\"*I feel that the critics who said something positive about this movie are just like the emperors subjects, afraid to state the obvious: that this movie was horrible, pretentious, and a complete waste of your money and time. If they stated the obvious, would they look unfit to be a critic, stupid or incompetent to other critics? Instead, now they look unfit, stupid and incompetent to anyone that has seen this movie and realizes how bad this movie truly is. For those critics, fantastic job in destroying your credibility.*excerpt from Wikipedia",
    "rating": "1"
  },
  {
    "title": "Worst Movie I've ever seen in a theater",
    "content": "I have to idea how this got 71% on rotten tomatoes. This has to be the worst movie I've ever seen. It has quite literally nothing of what makes a movie - no plot, mediocre acting, shitty cinematography with over used over the shoulder footage. I want my money and more importantly time back.",
    "rating": "2"
  },
  {
    "title": "can't make lemonade outta this",
    "content": "Spoilers AHEADI love reading the take on theme and religion and allegorical nonsense. This is just a bad movie. And I really like Lawrence, Harris and Pfeiffer normally. But not even they could save this. If you pretend really hard, yes, you can see Lawrence as Mother Earth and the rest of the gang as the evils of mankind (war, disease, pollution, greed, blah blah blah) but frankly, it doesn't make the movie any better if your audience misses the point. And if you're writing for the three people who might get it, you're not really someone that should be given the kind of money it takes to make a movie. Seriously, donate it to charity. It'll be better overall for the world.",
    "rating": "3"
  },
  {
    "title": "Mother! Film Review",
    "content": "The new horror thriller film Mother! starring Jennifer Lawrence, Javier Bardem, Ed Harris, Michelle Pfeiffer, Domhnall Gleeson, Brian Gleeson, Kristen Wiig. In Mother! a couple's relationship is tested when uninvited guests arrive at their home, disrupting their tranquil existence. From filmmaker Darren Aronofsky (Black Swan, Requiem for a Dream), mother! stars American actress Jennifer Lawrence (The Hunger Games films, X- Men films) as Mother, Spanish actor Javier Bardem (Skyfall, The Counsellor) as Him, American actor Ed Harris (The Rock, Apollo 13) as Man and American actress Michelle Pfeiffer (Batman Returns, Grease 2) as Woman in this riveting psychological thriller about love, devotion and sacrifice.Amongst the other actors / actresses in Mother! includes Republic Of Ireland actor Domhnall Gleeson (Ex Machina, Star Wars: The Force Awakens and is the son of Republic Of Ireland actor Brendan Gleeson and the older brother of Republic Of Ireland actor Brian Gleeson) as Oldest Son, Republic Of Ireland actor Brian Gleeson (Logan Lucky, Tiger Raid and is the son of Republic Of Ireland actor Brendan Gleeson and the younger of Republic Of Ireland actor Domhnall Gleeson) as Younger Brother of Oldest Son and American actress Kristen Wiig (The Martian, Bridesmaids) as Herald.Mother! was filmed in Montréal, Québec, Canada the French speaking area of Canada.Overall Mother! is a pretty average film filled with horror, drama, weird bizarre scenes, torturous stuff, violence, shooting, hard hitting scenes, chaos, carnage, fighting, siblings rivalries, dark stuff, flashbacks, arguing, love, sacrifice, devotion, big crowds, lots of people, things that don't make that much sense and other things throughout the film.So I will give Mother! an overall rating of 2 out of 5 stars and you can pick and choose whether you want to go and see Mother! in the cinema or not and in my opinion I found it torturous to watch, I thought the plot of the film was very thin and there was not much of a story to the film and to me not much in the film made any sense and I was constantly saying why did this happen and why did that happen.",
    "rating": "3"
  },
  {
    "title": "Don't waste your money",
    "content": "So how do i explain this, if you want to waste money have too much of it and kind of wanna use it for a fireplace. Well this is the movie for you, terrible acting, unconvincing moments, obvious ending, Jen should stick to children flicks and CG effect movies, the other reputable actors should never take on garbage such as this. This is just my humble option, so do what you wanna do.",
    "rating": "1"
  },
  {
    "title": "Horrible Pathetic",
    "content": "This was an awful movie, what the F.... I spent $50 on tickets for the entire family and $30 for popcorn and whatever my kids wanted to eat waste of my money, I feel like asking I want my money back. Problem is not only that the movie is pathetic but there was no sense of any scene in the movie, there is no connection to any scene and there is no way you can say Jennifer Lawrence is a mother earth if she is what the hell how was she what scene makes the sense???? OMG, we all in the theater were like what The F. such a waste. I have washed flop movies too but no one can beat this non-sense movie which had no sense. OMG",
    "rating": "1"
  },
  {
    "title": "Not worth it",
    "content": "I don't usually give a review. I love the cast but the movie itself was really bad. It was confusing and painful to watch. We couldn't wait until it was over. I would not recommend paying money to watch this show. They never give closure or attempt to explain what the story plot was about. Several parts were down right disgusting and no apparent reason for them. There were only a couple of other viewers in the theater with us but they were just as disappointed as we were.",
    "rating": "1"
  },
  {
    "title": "Beautiful example of how Hollywood just doesn't get it.",
    "content": "From what I have been gathering from other viewer's interpretations is that mother! is a allegorical story of God, \"Mother\" Earth, and humanity. Javier Bardem is god. Jennifer Lawrence is mother earth.The fundamental problem with Hollywood's understanding of Christianity stems from their lack of knowledge of the foundation of the faith, that being the scriptures. The film, in it's metaphorical story-telling, idolizes Earth to the point where it is also viewed as a deity. We see this in many films including Avatar. Gaia worship, or worship of the earth, has no place in Christianity whatsoever. It is readily apparent that Hollywood has adopted Gaia worship as their faith and they're clearly upset that Christians aren't worshiping their God. This is personified in this garbage heap of movie. I expect a fire sale of studios to Chinese firms in the next decade.",
    "rating": "1"
  },
  {
    "title": "Comedy Not Horror",
    "content": "This movie should be changed to Comedy, for it has no horror. If the soundtrack to the Benny Hill show was added it would make more sense. Sure I get what they were trying to say esoterically, and save it I don't want to spend my money on crappy films like this. One day this will go down as an Ed Wood type of classic.",
    "rating": "1"
  },
  {
    "title": "What a twisted Evil load of Crap AGAIN by Darren Aronofsky",
    "content": "This film is an embarrassment to anyone paying good money to be entertained. Does Hollywood not get it? Darren Aronofsky is not good at writing or directing, his twisted ideas are not worth the time and money. Did no one learn from that ridiculous drug trip of a film \"The Fountain\"? It is my understanding that Hollywood is a business. So why is it that they keep giving this idiot money to try and make money with a movie? The plot is thin, like it was written without any thought, overnight, just a bunch of malice towards good people! The acting is honestly campy and embarrassing. The plot is beyond any rational persons time. It is not entertaining, it is not good for anyone to watch, it is just another waste of good money. Money that could have gone to Hurricane victims instead of this writer Director! And Lawrence, what was she thinking? Did she even read the script before committing to it? I have lost faith that she understands what a good script is. She was lucky to hit it big, and now we have to endure her attempts at acting. If she was not so self righteous, and arrogant, she would be taken more seriously. But to align with this film... Obviously she knows she has no talent. It would also be nice to see an actress who is not so full of herself, and actually earn her stripes instead of just lining up for whatever film falls in her lap, no matter who she is sleeping with. Get a brain and get serious about your craft... and the business. Keep your mouth shut, select good scripts, and Earn your respect. Honestly, no one cares about your real life personal ideas, you're getting paid to be a fake person on screen. Do good work, entertain, and help society be better! I gave this a \"1\" and that is generous!",
    "rating": "1"
  },
  {
    "title": "This movie is a joke",
    "content": "I would suggest you do not waste your time or money seeing this film. Plot is terrible and the main stars acting makes this become at best a B rated film. Sharknado has a better plot line then this. NOt sure why they thought doing a copy of rosemary's baby centered around a rotting house would make people want to see this film.",
    "rating": "1"
  },
  {
    "title": "Raw Art as its best",
    "content": "I left Mother! with a bitter taste in my mouth. My visceral self didn't like what it just witnessed. However, as I reflected and let my mind go over the movie itself, I started to see all its quality, its symbolism. One day after having seen it, i can clearly say that i love this movie, and i suspect that it will be in my all time favourites as time goes by. This is the power of Mother!, one true experience. It's raw artistry of the highest order, a reminder that Art is better left as unchecked as possible.",
    "rating": "10"
  },
  {
    "title": "Worse Than Springtime For Hitler",
    "content": "THIS is the writing, directing and acting that would have helped Max Bialystock and Leo Bloom fulfill their original plan. An entire film of blatant metaphor meant to feed the writer/director's ego along with 2 hours of his girlfriend grimacing and suffering from indigestion... and I used to think that Jennifer Lawrence was a decent actress. The film might have been salvageable through Michelle Pfeiffer and Ed Harris playing Adam and Eve, since their acting was fantastic despite the poor writing. It was even salvageable after the writer insulted the audience when he included 'Adam' missing a rib, one of their sons murdering the other one, Eve's alcoholic fruit drink and then all of them getting banished from Mother's \"Paradise\"... all so the author could be sure that the audience got the boring biblical reference. Beyond that it was just a writer portraying himself as a 'god' which destroys everything in its life, and ridiculous characters on a bath salts trip... excruciating writing and imagery, full of over-the-top representations. The baby getting its head snapped and then eaten was the height of absurdity. Too much nonsense, and barely any good writing or original plot. In the theater, the audience burst into laughter when the film ended and everyone was saying that Mother! was the worst film they have ever seen. I kept hoping the film would get better, but it just kept getting worse. I burst into laughter too at the end. It's really that bad.",
    "rating": "1"
  },
  {
    "title": "Beware! Run From Mother!",
    "content": "This was the worst movie I have ever seen in my life. There is no redeeming value to this depressing, rage-filled, loud, poorly acted movie. Jennifer Lawrence is no star. We wanted to ask for our money back. This is not art. This is a piece of garbage. The bloody, violent scene after she had her baby is so disgusting. The violent mob in her house, snatches her baby after she gives birth, pulverizes the baby and hungrily eat pieces of it. She is punched, kicked and knocked down by the mob as she tries to save her son. There is absolutely no chemistry between her and Javier Bardam. There are enough crazy, violent, angry anything goes people in real life. Why would anyone want to go to a movie that makes you walk out feeling depleted and as if your mind and soul have been beaten? We will never see another movie with either one of these two so called \"actors\". No wonder why no one goes to the movies anymore.",
    "rating": "1"
  },
  {
    "title": "Got out of idea to explain what was going on.",
    "content": "First of all, when you write an essay, you must have Introduction, Body and Conclusion. Even your essay is awesome at the Intro and body but your conclusion sucks, it is considered as a bad essay. A movie should be the one which someone created a good story and someone directed and made it. You just put whatever things like the stone, the blood and the hole on the floor, the weird family so you have to explain what are those stand for because that's your idea. The viewers stepped out of the theater with lots of stupid thoughts and we don't even know what is what exactly. Trying too much to make it different from other movies and it's obviously FAILED! This movie seems like, got into someone's head who is mentally sick so he could just think whatever but there will never be conclusion. I'm wondering if the writer even understands the whole story. Also I'm amazed by it got a producer.",
    "rating": "1"
  },
  {
    "title": "Excellent cinematography and acting, appalling script",
    "content": "Basically, terrible. Why Aronofsky thinks I want to see all his anxieties on screen is beyond me. The plot: a husband lets a load of strangers into his home ignoring his wife's protests. They cause all sorts of problems, being abusive, ignoring her privacy etc. She has a baby which is killed by the strangers and she dies. The husband isn't too bothered because he needs the adulation from the crazy crowd/ fans. It loses all realism early on ( I would have kicked out Pfieffer straight away) and delves into fantasy. It's like some sort of surreal nightmare. Aronofskys anxieties on relationships and fame. Do me a favour , keep your anxieties between yourself and your counsellor, don't make a film about them. Show me something inspiring (examples, Neo discovering his potential in The Matrix, Jake discovering his morality in Avatar). Not for me. If you like pretentious anxious nonsense you'll love it.. If you like compelling inspiring stories, maybe Hollywood can make one which deserves the actors in this film one day.",
    "rating": "1"
  },
  {
    "title": "Aranofsky's torture porn movie about climate change (gimme a break)",
    "content": "A pretentious piece of garbage masquerading as art. The work of a director who's gotten so full of himself he's become completely blind to his shortcomings. This is nothing more than torture porn. Aranofsky's become as awful as directors like lars von trier and terrence mallick. The metaphors and allegory about climate change are non-existent. This is a film that makes sense to the artist making it and no one else. Critics praising this film are pretentious sheep who are drinking the kool aid. There is absolutely NOTHING redeeming about this movie. Stay the hell away.",
    "rating": "1"
  },
  {
    "title": "The worst movie I've seen in my life",
    "content": "It is the only movie that made me angry while I was watching it. The plot is so stupid, the main character doesn't say anything to the partner even if is clearly she is bothered by everything that is going on. After 90 minutes I left the cinema because I couldn't stand it anymore.",
    "rating": "1"
  },
  {
    "title": "No longer a fan of Lawrence",
    "content": "I will NEVER watch another movie with Lawrence in it! Her rant about Mother Nature punishing us for electing Donald Trump as President of The United States of America is quite possibly the most stupid ideal I have ever heardI used to think she was different, authentic even interesting...obviously I was so very wrong",
    "rating": "1"
  },
  {
    "title": "Those are lovely New Clothes, Emperor",
    "content": "My name is Aaron Darrenofsky, and I am much cleverer than you. Specifically, I can make a horror film except it's not a horror film, you see. It's a very clever metaphor.But what's it a metaphor for? That's even cleverer, because I don't have to tell you! No, I can leave you to make up your own meaning and then you'll be pleased that you're (nearly) as clever as me! And if you think \"What a pile of pretentious claptrap\" then I have an army of people who really love The Emperor's New Clothes, and they'll tell you that you're too stupid to understand it.This starts off well, then you come to realise it's art-house nonsense, just dressed up in horror film clothes. Jennifer Lawrence gives the worst performance of her career so far in a part which her boyfriend has underwritten and badly directed: he has not done her any favours with this unsympathetic, unrealistic, one-note sacrificial lamb.A bad, horrible film. Please avoid it. And please avoid Aaron Darrenofsky and the similarly named charlatan who made this pile of tripe.",
    "rating": "4"
  },
  {
    "title": "How not to get over writer's block by Darren Aronofsky",
    "content": "Marmite films, the ones you'll either love or hate, are a rarity these days. Films that polarise audiences certainly have a place in the world, their subjectivity often leading to intense discussions regarding what exactly it is they represent. Darren Aronofsky's mother! had some striking promotional material, the poster featuring Jennifer Lawrence's Mother with her heart ripped from her chest being the one that stuck with me the most, and it reportedly divided audiences at the Venice Film Festival with half giving it a standing ovation and half booing it. For these reasons, I was definitely intrigued to see Aronofsky's latest.A couple's tranquil existence is disrupted and their relationship tested when a number of uninvited guests arrive at their home.For the first hour or so of mother!, it's safe to say I was fully invested in the mystery surrounding the narrative and characters of Darren Aronofsky's film. It's clear from the very first shot that this isn't going to be an easy film to sit through, the image of a burning woman certainly striking a chord but then completely juxtaposed within seconds as we begin to see the tranquil surroundings of Mother and Him, portrayed by Jennifer Lawrence and Javier Bardem.As their peace is eventually disturbed by a string of strangers, who begin to arrive in their numbers, refusing to leave or acknowledge Mother's place as the homeowner, my intrigue grew more and more. The visions of Mother and the weird behaviour of both Him and their guests surely had to have a worthy pay off.I was wrong. Aronofsky's film takes a bizarre turn for its final act and it left me on the verge of hating this film. You'll struggle to see why mother! warrants an 18 certificate until the final act and, when you do see why, you might just be scratching your head like me. There are some very distressing moments put to film here so I warn you now, if you're easily offended, this might not be the film for you. It might be open to interpretation however, I just sat in my seat questioning what exactly had just happened before my eyes. Maybe mother! is a film that I would need to watch again to fully understand but right now, I'm not a fan.That's not to say I didn't appreciate anything about this film because there are some very good performances on show for a start. Jennifer Lawrence may have her haters but, for me, she's one of the best young actresses working today and she showcases her talent with a performance full of paranoia and vulnerability. Javier Bardem, Ed Harris and Michelle Pfeiffer make for an extremely mysterious trio, each of them honing in on a behavioural trait to cause Lawrence's Mother to fret so much.Darren Aronofsky's mother! is a home invasion thriller the likes of which have never been seen before. The film may look gorgeous and feature some fine performances however, when the film decided to opt for the batshit crazy route for its final act, it lost any hope of me marking this as a modern classic.",
    "rating": "4"
  },
  {
    "title": "An Extreme Dose of Lynch and Kubrick come with Aronofsky's Very Pretentious Mother!",
    "content": "Mother! tells the story of a young woman and her older husband as they move into their dream home in the countryside. One night, an older couple shows up at their door and all hell breaks loose from there on out. Now, Darren Aronofsky has been a personal favorite since Requiem for a Dream. His sense of style and perfection to his craft always resonated in his films. The hiccup of Noah was understandable but this film is a film that just should have been better. While I did love a lot about this film, there was almost an equal amount that I didn't. First off, I loved the sense of dread the film gives off. It is less interested in giving the audience jump scares rather than making the story and images linger in your mind like a bad dream. I loved Aronofsky's visual style here especially in his set design. The house is a character in and of itself (not to sound totally redundant). I also loved the cinematography. Much like Black Swan, this is a very sweeping spectacle of camera work that is intoxicating. As intoxicating as the technical aspects of the film are, the actual story, script, acting and overall pacing leave much to be desired.Mother! is most certainly a film that plays with your mind but I wouldn't necessarily call this a psychological thriller. This film is a horror film that the minds of Kubrick and Lynch would bring you, not Aronofsky. The script is bare minimum, the story is paper thin and the acting is wooden and overall plain. There are no stand out performances like there was in Black Swan, The Wrestler and even Noah. It falls flat and that really takes you out of the film. Javier Bardem is another very strange casting choice. You'd think he would knock this performance out of the park but it really was quite opposite here. Truthfully, the actors don't seem like they're interested in the work until the final 15 minutes of the film and by that time, I had about given up.Overall, Mother! is a very strange film that Aronofsky had seemed to not put that much thought into. While I do plan on watching it a second time to get the full effect of it because the last 20 minutes or so is a real mindf*** that is bound to throw everyone for a loop and/or anger a lot of people. Either way, this one is bound to be a divisive one among cinema lovers and Aronofsky fans as I doubt many average movie goers will take to this.",
    "rating": "6"
  },
  {
    "title": "If a movie had to be that bad, make the agony shorter!!!",
    "content": "Senseless movie, going from nowhere to... nowhere 2 hours later! People in the theater meeting in the restrooms after the show were looking for other people to confirm that they were not the only ones to have found the movie an absolute waste of time!!! Even a great actress like Jennifer Lawrence cannot save the movie. Stay home and watch ANYTHING else, and you'll feel happier!",
    "rating": "1"
  },
  {
    "title": "Please don't watch this",
    "content": "There is not way in the world this could be considered a good movie. What a waste of good actors - 2 Oscar winners, a great beauty and one of the finest character actors out there. Jennifer acts well but what a waste of talent. Javier as some fame whore is convincing but what on earth for? Michelle's attitude is quite something - she should act more.Too many things that don't add up to anything - red herrings and pointless scenes and dialog. It's not clever and just so awful.Tried to be fair to see the allegory about mother Earth and Adam and Eve is just not enough to justify such an assault on the senses.",
    "rating": "1"
  },
  {
    "title": "This is the worst film I've seen this decade",
    "content": "Allow me to clarify that this is not the worst shot (except for the framing), written, or acted film of this decade; in fact, the production of this film was overall quite strong, and I think the payoff was anything but lackluster or disappointing. The film also isn't at fault for having a misleading trailer, though thankfully I tend to watch films before I see their respective promotions. However, the build-up for it was unnerving to sit through as an audience member, watching characters whose actions and ideals don't relate to me or anyone else. In that way, it was kind of like The Mist. I wanted to throw objects at the screen.The characters had no other purpose than to serve this film. That's it. Unlike any other film in history, they don't seem to be in a universe that mirrors ours or is a fantasy version of ours, or what have you. Even if Star Wars or A Bug's Life isn't real, at least they have established the existence of it within the film's construct. Whereas for mother!, if time did not exist before or after the events of this film, it wouldn't matter. Nothing would be lost or gained. There is no understanding of its construct. It simply 'is' and it doesn't seem like the characters have a clue that they aren't in something that resembles our world. I think this is where the biggest mistake is made. Somebody mentioned this would work well as a play, and I actually agree. Not as a movie, though.I went through my Blu-ray collection and I asked myself: \"What other films represent a universe that a set of characters don't accept, believe, or is not cognizant about its unbounded principles?\" I couldn't come up with any, because eventually they all seem to find their way in, or it just takes the characters time to get the audience to feel out that kind of universe. In that case, the films that I came up with were: The Adjustment Bureau, Stranger Than Fiction, and Scott Pilgrim Vs. the World. STF is really the only one that comes close, but the awareness factor still kicks in. Not to mention it's actually a good film.Let me put it to you this way: pick any musical out there, where characters just spontaneously burst into song and dance in unison and music somehow is playing as well. Let's pretend there was a film where this happens, and the onlookers who are not a part of the number start flipping out, wondering what is going on, try and intervene to stop them, etc. but the singing characters are completely unfazed by their attempts and just keep going... and after the song is over, they go on with their lives like that singing never happened (which is kind of how I imagine they \"really\" go). That's what this film felt like, only it plays out more like a Black Swan-esque psychological horror. This film just felt nightmarish: impressive feat, but in the wrong context of being a completely metaphorical film it became a very unappreciative watch. The characters become helpless in their want to bestow basic fundamentals of humanity upon each other, which as I understand this is a point of the film in itself, it just does not work well when presented as an allegory.Speaking of the context (thematic spoilers ahead), mother! is basically a re-telling of the Book of Genesis, where certain characters and items play parts of the book, and Jennifer Lawrence's character is mother nature itself. Yet again, the problem is the characters for the most part don't know that this is what they are, so when they expect things to pan out like it does in real life and it doesn't happen, they don't have a clue why and don't realize their world had no past, perhaps has no future, and really is just serving one greater purpose: to be a film. This is not what storytelling is about, no matter how clever Aronofsky was in pulling this together (mind you, it all came off as very pretentious). And this wouldn't be such a bad thing if the movie didn't upset you with literally every character, but it did and I could not look past any of it.By no means did this film fail to do anything that it intended (though people seeing the trailer and expecting a house invasion horror film will be very disappointed), but to green light this thing in the first place and give it a budget seems asinine. To quote Jeff Goldblum in Jurassic Park: \"They were so preoccupied with whether or not they could, they didn't stop to think if they should.\" This art house film brings the audience no enjoyment of their theatrical experience, no commentary regarding the fabrication of human nature and societal flaws, no deeper extrapolation of biblical events, and simply it does not make a purpose statement. This has been my least favorite movie-going experience of the decade, even though that is not at fault of the director's execution.",
    "rating": "2"
  },
  {
    "title": "A Polarizing Failure",
    "content": "Rarely has there been a motion picture as polarizing as \"Mother!\" Critics seem to be split almost down the middle in their consensus about half seem euphoric over the picture, and the other half are furious. Of those critics who endorse \"Mother!\" many seem to be leading their defense of the picture with a vague suggestion that they like it because they're really, really smart, and the rest of us in the audience are dumb, dumb, dumb. And cousin, we all know that just ain't the way it is.Of course, it doesn't matter one bit whether the critics love or hate \"Mother!\" Plenty of motion pictures open to enormous critical acclaim and still die a slow, painful death at the box office. The difference to a motion picture's success or failure is the audience, the people who pay to see it. Most movie critics approach a picture with the advantage of not having to shell out their own do-re-mi for tickets. Audiences who have to actually reach for their wallets in order to see a movie mightand sometimes dohave a completely different reaction to the picture than the critics. And the audience's reaction to \"Mother!\" is historic in its emphasis.CinemaScore, a Las Vegas-based polling service which surveys audience opinion of a motion picture on a scale from A to F based on exit interviews with theater patrons, reports an average audience score of F for \"Mother!\" In the history of CinemaScore, no other movie's rating has ever been that lownever, ever, ever.In fairness to \"Mother!\" CinemaScore conducted their interviews with movie patrons while they were on their way out of a screening, undoubtedly still furious for having spent a substantial chunk of change on the experience. Had CinemaScore given audience members a day or two to calm down, the grade might have improved to something more like a D, or a D-minus.\"Mother!\" after 2014's \"Noah,\" is writer/director Darren Aronofsky's second whack at rewriting the Bible's Book of Genesis. Some viewers might remember \"Noah\" as the movie which revealed that giant three- armed monsters made of rocks did most of the heavy lifting as Noah built the Arka point later explained to have been subjective, but was suspected by many observers to have been included in the picture as a means of luring in the \"Transformers\" audience.Starring Jennifer Lawrence and Javier Bardem, \"Mother!\" nominally depicts the disruption of a married couple's tranquil life when unexpected guests arrive at their home. But actually, \"Mother!\" is an allegorynothing is what it seems. The characters and situations are symbolic, and are designed to illustrate the director's interpretation of events described in the Old Testament. This notion is augmented by the names of the charactersMan, Woman, Him, Oldest Son, Younger Brotherand naturally, Mother.One of the likely problems with the reception is that \"Mother!\" has been seemingly marketed as a horror picture, a sort of distaff, opposite version of 1968's \"Rosemary's Baby.\" The misleading marketing was an error which \"Mother!\" star Jennifer Lawrence took to the television talk show circuit to correct, prior to the picture's release. But instead of clarifying the issue, the infallibly candid Lawrence effectively further obscured the point by acknowledging that she didn't know precisely what \"Mother!\" is, except that it's brilliant and intense. During post-premiere interviews, Lawrence even actually seemed acknowledge that \"Mother!\" goes at least a little too far.Which might be the understatement of the week. More than a reimagining of the Book of Genesis, \"Mother!\" sometimes more closely resembles a reimagining of Edward Albee, and \"Who's Afraid of Virginia Woolf.\" And certainly there's no disguising the knowledge that during a week when only two new major motion pictures were released to theaters, \"Mother!\" came in third at the box office, and debuted to an audience which by all appearances plainly despised it. Should you decide to attend \"Mother!\" be prepared to hate yourself later for having wasted a fistful of dollars, on a movie which probably shouldn't have been made at all.",
    "rating": "1"
  },
  {
    "title": "poor sci-fi",
    "content": "As a science fiction fan I found this film to be poorly done in story and how it was told. The evolution of the scenes was awkward and did not flow well. The graphic's were good. I also thought the dialogue was poor. The story seemed random and did not flow well. There was no background on the lead male character. This may be a good story, but this film was not the vehicle to tell it. I would not recommend this film to my friends.",
    "rating": "3"
  },
  {
    "title": "Don't believe the trailers!",
    "content": "Went to see Mother! earlier today, and quite honestly, I feel like I've been lied to. If you must go, a warning...do NOT believe the trailers. Mother! is not a horror film, it's not a home invasion thriller, and it's probably not like anything you've ever seen before. Mother! is a two-hour exercise in cinematic torture. OK, maybe that's a little harsh, but I don't particularly enjoy being yelled at for 120 minutes that humanity is destroying the planet. And that's what this art house film disguised as a \"home invasion horror\" film is...a biblical allegory with an environmental message. The last third of the film is very difficult to watch and some of the visuals are more than disturbing. And I've seen some pretty horrific stuff over the years. The mistake with Mother! is in the marketing. If you go expecting a standard horror film - even an \"out there\" horror film - or a home invasion thriller, you'll probably hate it. At the very least, you might feel like you got played. You might even have a WTF moment...or many of them. But I'm not suggesting you stay away. What I would suggest is reading up on the film first. Read some of the good reviews out there that provide some explanations about the purpose of the film and the meanings within the movie; it will not \"spoil\" anything. If you know what the director is trying to convey, you might better appreciate the message. In my opinion, if you don't know what it's supposed to mean, you'll probably find yourself wondering what the hell is going on halfway through. This film is from controversial filmmaker Darren Aronofsky, who also directed Black Swan. If you think Black Swan was a bit strange, surreal and just a little off, you haven't seen anything yet. So yes, go see it for what it is - an art house film full of symbolism. But prepare for it first, or you may have to see it again just to understand it.",
    "rating": "4"
  },
  {
    "title": "A Metaphor that Doesn't Work in the Slightest",
    "content": "There are certain movies that just aren't my cup of tea. Mother! is the type of movie where your reaction could be predicated on what you expected. Having watched only a little bit of the marketing campaign, I didn't entirely know what I was in for. With that said, Darren Aronofksy has a distinct style in each of his films, with each being highly divisive in nature. Mother!, which could be one of his simplest and yet ambitious films to date, is perhaps the only film of his that I just can't come around to.Because of how difficult it is to discuss the film's plot without giving anything away, I'll just say this is the part of the review where you turn back if you have yet to see it. (SPOILER ALERT). This film is about mother earth and god. Yep, Aronofsky has made another film tied into the bible, except this time, It's a complete borefest. I say this with the utmost respect for the filmmakers, as I can always appreciate a film that does something different with its plot structure, but there wasn't a single moment of Mother! in which I was invested. If Aronofsky set out to make an uncomfortable experience than he can consider this film a success. Seemingly only using soft- focus and close-up shots of his actors, there isn't a single moment of comfort in the entire film. That can work in a movie, if the story is good enough (see. Requiem for a Dream), but if the film is simply plotting along to get to that big exclamation point ending, then it's just not that good.Fittingly, the reviews have been pretty mixed so far. I figure a movie which mostly deals with humans ripping Jennifer Lawrence's earth apart and poorly treating their surroundings isn't the easiest audience or critic pleaser. However, I expected more from this film. Labeling it as a horror-mystery is certainly deceiving. Was the mystery supposed to be on what the film is actually about? Was the horror just supposed to be those last 20 minutes when everything goes to sh*t? I often talk about how an ending can save a film from being mediocre, but I think it can just as easily take an okay film and turn it into a complete let down. I think that's where my main complaints lie with this film, is that it's not at all what I wanted it to be, and the metaphor they were going for (while an interesting idea/premise) isn't executed in an interesting way.As I said, I can always appreciate how original some art-house films can be, and Mother! is certainly no different. But the execution left me feeling dull, unimpressed, and downright bored. So even if there's some cool ideas, I can't give this a positive review.4.0/10",
    "rating": "4"
  },
  {
    "title": "Building, Building, Building......",
    "content": "I just finished watching \"Mother!\" and I have to say I was interested up until about halfway through the film. Things seemed to be building to something climactic, but the all of a sudden everything just comes off the rails and the story spirals into an incomprehensible oblivion. I really wanted to get the meaning or point of the film, but ultimately I left completely lost. I really could not figure out what the Director was trying to say or what the point of the movie even was. Maybe I am not artistic enough or creative enough to garner the point, if there even was one. My advice is wait and see it on Netflix or rent it. I don't advice spending your hard earned money. I like all the actors especially Jennifer Lawrence, but for the life of me I could not figure out why they would allow themselves or their reputations to be put on the line with something like this. So anyway if you don't want to take my word for it, go see it and share your opinion. Maybe you will be able to get something out of it, but I could hear everyone around us as we left the theater saying how awful it was, so I know that I am not alone in my feelings towards this film. I think its fair to say you have been warned.",
    "rating": "2"
  },
  {
    "title": "Pretentious Bilge 'spoiler'",
    "content": "Yawn...... Mother Earth,The Bible- Cain and Able, Adam and Eve, The plagues, the Ego, God, Jesus, Communion, the environment,Wars, The loss of faith,The power of the creator, Armageddon, re-incarnation etc , it ends with 'I am I'.....(presumably the test audiences needed a clue at the end......) Yes, we get the allegory, the metaphorical twadlings and the egotistical nonsense. Put them in a pot, stirred by Jennifer Lawrence walking around a house for 2 hours and you have a huge bucket of pretentious bilge. Absolutely atrocious.",
    "rating": "1"
  },
  {
    "title": "A travesty of epic proportions",
    "content": "This film will undoubtedly go down in history as an exercise in both your patience and tolerance for pretentious, self-indulgent crap. This is exactly what I imagine a vanity project to look like, where a director writes a script as he is surrounded by Yes Men, all exalting his every word. \"You are a Genius\", they screamed, as they held the finished script up to the heavens, \"You are the greatest visionary cinema has ever seen!\". And Aronofsky saw that it was good.This is what I imagine was going through this egomaniacs mind as he wrote this abomination. This movie is the end result of not understanding your own creative output, not having a filter, not having an editor that will call you out on your B.S., and not having a crew that will smell a stinker as they were working on one.Not a single person stopped him and said, \"This isn't good, Darren. This is needlessly obtuse, grotesquely realized, and lacking any real semblance of narrative and true storytelling. Your allegories and metaphors were either blatantly heavy handed, or ambiguous, and your symbolism was obscure but added nothing of value to the overall film. It's not your best work, Darren. I think you should rethink this.\" I would have been that crew member, especially if I cared about what I was attaching my name to. But this is Hollywood, where millionaire's tell me about social injustice while they drive their hundred thousand dollar cars to their gated communities, away from the people they swear they care about. I really can't expect much from professional liars, and this movie just proves that Hollywood is running rampant with a degenerate disease that is stiffing creativity, passion and craft, instead politicizing everything, virtue signaling, and attempting to inject social commentary where none is welcomed.Darren, I love your movies. I was there day one for Requiem and for Fountain, and I LOVED Black Swan with a passion usually reserved for Asian films. But this movie, this failure of Biblical proportions is not only the worst thing you have ever done, but it quite possibly the worst film I have seen all year. Humble yourself, man. You are a respected auteur in a field rife with paint-by-numbers movies, created by committee. Your films illicit feelings of great love for the craft, and create fans of cinema as a whole. But you have to reel yourself in, or hire people who will. You cannot surround yourself with people who will offer nothing but praise, much like the character Him in this movie. You are not God, you are not a god, you are just a man. And like any man, it takes a great failure to bring you down from flying too close to the sun. Learn from this, and never repeat this farce of a film. You, nor I, deserve any of this.FYI; I gave the movie 3 stars, because despite all else, the movie was breathtaking to look at. Seriously, the cinematography was the only thing this movie had going for it. There was a mouse in the theater that I found infinitely more entertaining that this movie.",
    "rating": "3"
  },
  {
    "title": "Don't bring your mother anywhere near mother!",
    "content": "Probably one of the worst acting that I have seen in a long time. What a colossal waste of money for the studio and movie goers! Weak story line, bad cinematography and terrible acting. The movie just felt so fake to me while watching it. Take my word for it and save yourself two hours of misery. Avoid this one at all costs!",
    "rating": "1"
  },
  {
    "title": "Terrible movie. Even after reading reviews/interviews with the director, it STILL MAKES NO SENSE",
    "content": "This movie, advertised as a horror movie...wasn't far off. This movie was horribly terrible! I was uncomfortable most of the movie as it had ZERO plot line, followed no path of a story, gave no reason for anything that was going on with the characters and explained nothing. If it weren't for the popcorn with butter I was snacking on, I would have had nothing good about this experience. So, I went online today to find some reviews or some explanations of what the heckfire this movie was about. Aaaannnnnd, it did not help at all. It was a story told by an \"artistic\" director's mind as if in the midst of a whiskey fueled cloud of incoherence. I felt like sitting thru this movie is like listening to a college friend try to explain our existence on earth after they'd been drinking Jagermeister all night. Oh, and trying to tie it into religion after their 1st theology course at a community college. All-in-all, save your money and time and see ANYTHING else.",
    "rating": "1"
  },
  {
    "title": "Awful Film that looks like it took 1 day to write - bad acid trip and waste of time",
    "content": "This film is by far the worst film this writer/director has made and i really enjoy his other films. This one however is a waste of time and clearly shows that the Writer/Director belongs in an insane home for the mentally ill except that Hollywood gives him a place to plant his madness. It is no wonder he wrote this piece of junk in 5 days maybe hooked on some nasty drugs or bad acid trip or ex girlfriend left him. The film story goes from dull boring to the most illogical insanity that just makes you wonder what is the point of this deranged film. Sure it has biblical references blah blah if you are tripping out or stoned out of your skull but it has little pay off and the poor actors did the best they could. Jennifer Lawrence carries the terrible story as best as possible so kudos to her, and Javier Bardem is unconvincing unfortunately. A waste of a movie ticket and hard to image they allowed $40M on this piece of junk. Obviously it bombed in the theatre. Heck who wants to go see a film that provides no horror, no logic and you cant wait for it to end. Maybe it will be a great film study class on what Not to Do. At least it is a piece of Art... terrible awful deranged Art. They should re title it Writer Insanity and perhaps less people would be disappointed. Rating of 1 because 0 not available.",
    "rating": "1"
  },
  {
    "title": "What a load of Horse poop",
    "content": "Do not waste you time with this, walk away while you still can, this is two hours of your life that can be better spent, on the toilet, peeling potatoes, or watching paint dry. Do yourself a favour, picture the worse nonsensical load of horse fly poop you have even seen now maximise that to about 2 hours worth, turn around and walk away!",
    "rating": "1"
  },
  {
    "title": "Opinion on this movie",
    "content": "This is the most awful movie I have seen in a while. I appreciate good horror but this is absolutely terrible. I can not believe that such good actors agreed to be part of this stupidity. My point to all of you who didn't see this movie, don't even bother. Trust me, it is a total waste of time and a terrible feeling in your gut after. I therefore give it the lowest grade possible.",
    "rating": "1"
  },
  {
    "title": "Gender clichés and metaphor by numbers",
    "content": "This movie manages to reduce the characters into a pastiche of the same tired characters Hollywood loves so much...narcissistic alpha man,a virginal mother,a whore,a man in a grey suit....yawn.To add insult to one eyed injury we have metaphor...can it be called that when its trying so hard?The prism we look at things through is what gives us insight...and these tired character tropes,and the heavy handed attempt to be metaphorical,add up to a glossy waste of time.",
    "rating": "1"
  },
  {
    "title": "Never seen more disappointed cinema goers",
    "content": "This is a review I hope no one that was involved in the making of this film will see because I have nothing good to say about it, but that I hope many thinking of going to watch the movie will see, because the rating is very deceiving. In fact the only two reasons I can think of at this point for such a high rating are either fake / paid ratings, or a massive online prank.My expectations weren't that high, after seeing latest Jennifer's movies, but I didn't expect Mother to be so dreadfully bad either. I kept hoping that it would get better, that it would have substance or a clever twist. Unfortunately, it got even worse. And if we weren't too tired to leave, after a long day, we would have.I've recently seen The Square, which I didn't like that much either, but comparing it to Mother it was an artwork, it had substance and it had a story you could enjoy following, despite many scenes being quite uncomfortable to watch.Why am I bringing up The Square in this review? Because the worst part in The Square, the big flop in it (those who watched it know what I mean), has many in common with Mother's most shocking scene. And it's pointing at what is wrong with Mother.These movies where usually well-rated actors gather only to fail in delivering a good work are the most dangerous. Are Michelle Pfeiffer, Javier Bardem or Jennifer Lawrence actors whose movies are worth seeing? Jennifer is almost becoming a don't watch this warning sign, at least for me and my friends.One of us will have to learn the director's name also so we can avoid it's work also.",
    "rating": "1"
  },
  {
    "title": "Most awful movie ever",
    "content": "A lot of stereotype issues of the genius which is not understood and will kill anything just to feed his(in this case) need for validationWorst scene: his baby is eaten and he tells her \"let's forgive them, they are sorry\" second worst scene? the rest of the movieI was bored most of the movie and considered a lost time",
    "rating": "1"
  },
  {
    "title": "disgusting",
    "content": "Check out my ratings. Almost 1800 movies. All with a fair scoring!\"If we want something new at the movies,\" he said, \"you give them something new\" and they say, 'What the hell is that?'That's what Aronofsky said. I'm currently working on my own script(s) and I'll start off with a low budget feature that I'm going to make with my own money. My script has a very original twist that is easy to notice, to understand and it's also simple but it will f.. your head up. Especially if you remember the firt scene of the movie. I just had to think about it for a day. It's all original, not a movie or book has such a twist. I liked Aronofsky's works. Black Swan is a true 10 movie for me. But mother is not something new. It's a series of pointles acts that are just coming and making no sense. Beside this and beside that every character acts like they are crazy the movie doesn't even care about time! The ending of the movie or any other scene did not explain anything. All along the morbid humor and the pointles violence tried to keep up my interest but it massively failed. Aronofsky is massively failed. One of the worst movies I've ever seen. If Aronofsky thinks this is something new and it's good he should see a doctor. If you think it was good you should also see a doctor.p.s.: don't make reviews where you try to explain what happened in the movie while you gave it 10 star. google it and Aronofsky says it all.",
    "rating": "1"
  },
  {
    "title": "This movie was terrible, do not see it.",
    "content": "I walked out on this embarrassing disaster after 20 minutes and got my money back. If you leave before you've sat through a ½ hour of an awful movie you can ask the theater for your money back. Remember that and do it. Jennifer Lawrence is an overrated hack and not THAT good looking. She was dropped into America's lap by Hollywood several years ago and we were all told she was the next big thing and how incredibly sexy she was. I never bought into any of the manufactured hype around her, and no, she didn't deserve that Oscar. The Academy Awards is a leftist circle jerk that hands out baubles to actors that have the correct political views. This movie was terrible, do not see it.",
    "rating": "1"
  },
  {
    "title": "Very disappointing",
    "content": "Lets start this by saying now..this movie is NOT a horror movie !!If you want to See a Hollywood blockbuster scary flick then it is not for you ! I had tickets booked for opening night,I had no idea what it was about but still I was so excited to see this movie, the trailer made it appear fast paced and thrilling, sadly this movie was neither. As the film dragged on and got more and more strange all sorts of questions were going through my mind.. Is she dreaming? Is he some weird cult leader ? Are these people really there? There are lots of questions unanswered, what was the yellow powder she was drinking ? Why didn't she just go ? And finally the last Question at the close of the film... Erm what ? There were an awful lot of people who just plain didn't get it. In a sense its achieved one thing and that is that people are talking about it. Personally I felt it tried so hard to be \"deep\" it was pretentious, just overdone long winded and strange, really strange. I had to add this because I really am disgusted by a few who are not capable of making a point without being insulting. there are those who love this movie and those who don't, as with all movies its not for everyone, however because some feel its not a great movie does not give those who do the right to be insulting. sure have an opinion ..about the movie, but not other users, it doesn't make you look smart or by saying that those who disliked it have less intelligence and are therefore beneath you. It just makes you look pompous and shallow. OK I'll get off my soap box now 😞",
    "rating": "4"
  },
  {
    "title": "Reminiscent of  Rosemary's Baby Except No Has Any Names",
    "content": "The depraved religious impulse that animates this film is disturbing on two levels. First, as a testimony to the human mind's dark confusion that spins out an endless parade of demented frenzies of sacrifice and worship, and second, that the writer/director holds hostage any entertainment value until you are willing to accept his demented cosmology. But, I did love the feel given by Aronofsky's medium of 16mm film. Also, following Jennifer Lawrence's every move for practically two hours from six inches away was worth the torment.",
    "rating": "3"
  },
  {
    "title": "Run to your mother",
    "content": "This movie is awful. The story is awful. The pace is awful. The tension is awful. I totally hated it. I think that I never felt such an urge to stop watching a movie like this time, and I think I didn't do it because of one thought only: \"The actors are good, the director is good...there must be something in it..lets give it a try...\"..gosh! it never ended...too long...too boring...annoying...irritating. At times I felt I had to scream: horrible! They were always repeating the same idea...over and over again in a two hours movie. I wanted to like it, but I couldn't...not one bit. I hated it. I will never see it again and of course I don't recommend that you watch it.",
    "rating": "1"
  }
]
